/************************     הוראות חשובות      ***********************/

/**
 
 1.   במידה וזאת פעם ראשונה שלכם ממלאים תוכן בלומדה, קראו את **קובץ הוורד** המצורף בתקייה
 2.   בעמוד זה יש למלא את הפרטים לגבי כל המידע והתוכן המבוקש
 3.   [amountOfQuestions במשתנה] לשים לב שבכל נושא צריך לכתוב את *כמות השאלות המקסימלית* שתלקח ממנו
      **משתנה זה מתייחס רק לשאלות שיילקחו בשביל **המבחן
 */


/************************      הכנס כותרת ראשית שהיא שם הלומדה      ***********************/
const TITLE = "לומדת כרטיסיות";

/****     הכנס כמות כוללת מקסימלית של שאלות למבחן. יש לשים לב לכמות השאלות הקיימות מהבהד - שלא כמות שלא קיימת   *******/
// const AMOUNT_EXAM_QUESTIONS = 10;

/************************      הכנס כמות זמן התחלתית של המבחן      ***********************/
const TIME_FOR_EXAM = "10:00";

const DATA = { 
    // // דוגמה לנושא
    // "נושא 1": {
    //     "icon":  "../assets/images/learning/Artboard 4.svg",
    //     // שאלות לנושא הזה
    //     "questionsExam": [
    //         {
    //             type: "multiple",
    //             question: "דוגמה לשאלה אמריקאית מתרגלת שיש לה 4 תשובות?",
    //             ans1: "תשובה ראשונה ולא נכונה",
    //             ans2: "תשובה שנייה נכונה!",
    //             ans3: "תשובה שלישית ולא נכונה",
    //             ans4: "תשובה רביעית לא נכונה",
    //             correctAns: "ans2"
    //         },
    //         {
    //             type: "binary",
    //             sentence: "דוגמה לשאלה מתרגלת נכונה של נכון או לא נכון",
    //             trueOrFalse: true
    //         }
    //     ],
    //     "questionsPractice": [
    //         {
    //             type: "multiple",
    //             question: "דוגמה לשאלה אמריקאית בוחנת שיש לה 4 תשובות?",
    //             ans1: "תשובה ראשונה ולא נכונה",
    //             ans2: "תשובה שנייה נכונה!",
    //             ans3: "תשובה שלישית ולא נכונה",
    //             ans4: "תשובה רביעית לא נכונה",
    //             correctAns: "ans2"
    //         },
    //         {
    //             type: "binary",
    //             sentence: "דוגמה לשאלה בוחנת נכונה של נכון או לא נכון",
    //             trueOrFalse: true
    //         }
    //     ],
    //     "amountOfQuestions": 2,
    //     "lessons": {
    //         "שיעור 1": {
    //             "learningContent": {
    //                 "נושא למידה 1": {
    //                     "כרטיסייה ראשונה מסוג טקסט": [ 
    //                         {
    //                             cardType: "text",
    //                             content: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים."
    //                         },
    //                         {
    //                             cardType: "textTwoParagraphs",
    //                             text1: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים.",
    //                             text2: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים. זוהי הפסקה השנייה של התוכן."
    //                         },
    //                         {
    //                             cardType: "textThreeParagraphs",
    //                             text1: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים.",
    //                             text2: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים. זוהי הפסקה השנייה של התוכן.",
    //                             text3: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים. זוהי הפסקה השלישית של התוכן."
    //                         }
    //                     ],
    //                     "כרטיסייה שנייה": [
    //                         {
    //                             cardType: "twoPics",
    //                             pic1: "../assets/images/pic.png",
    //                             content1: "דוגמה לכותרת לתמונה הראשונה",
    //                             pic2: "../assets/images/pic.png",
    //                             content2: "דוגמה לכותרת לתמונה השנייה"
    //                         },
    //                         {
    //                             cardType: "picAndText",
    //                             pic: "../assets/images/pic.png",
    //                             content: "דוגמה לכותרת לתמונה הראשונה",
    //                         }
    //                     ],
    //                     'כרטיסייה עם הרבה תוכן וגלילה': [
    //                         {
    //                             cardType: "pic_4titles_4text",
    //                             pic: "../assets/images/pic.png",
    //                             subTitle1: "כותרת ראשונה",
    //                             content1: "תשובה לכותרת הראשונה במשפט.",
    //                             subTitle2: "כותרת שנייה",
    //                             content2: "תוכן המפרט על הכותרת השנייה.",
    //                             subTitle3: "כותרת שלישית",
    //                             content3: "תוכן תוכן תוכן תוכן.",
    //                             subTitle4: "כותרת רביעית ואחרונה לכרטיסייה",
    //                             content4: "תשובה אחרונה לכותרת הרביעית. ניתן להוסיף עוד משפטים כמובן.",
    //                         },
    //                         {
    //                             cardType: "_3titles_3text",
    //                             subTitle1: "אפשרות לכותרות ותוכן בלי תמונות",
    //                             content1: "ולכל כותרת יש תוכן כמובן",
    //                             subTitle2: "כותרת שנייה",
    //                             content2: "תשובה לכותרת השנייה",
    //                             subTitle3: "כותרת שלישית ואחרונה",
    //                             content3: "תוכן אחרון לתת נושא זה. מוזמנים לעבור לתת נושא הבא!",
    //                         },
        
    //                     ],
        
    //                 },
    //                 "נושא למידה 2": {
    //                     "כרטיסייה שלישית מסוג וידאו": [
    //                         {
    //                             cardType: "video",
    //                             video: "../assets/images/פתיח.mp4"
    //                         },
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     "כרטיסייה רביעית": [
    //                         {
    //                             cardType: "text",
    //                             content: "מלא מילים של נושא ספיציפי, שנראה לי שייצא יפה אבל בואו נגלה יחדיו!"
    //                         }
    //                     ]
    //                 },
    //                 "נושא למידה 3": {
    //                     "תת תת נושא 12": [
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     "תת תת נושא 23": [
    //                         {
    //                             cardType: "list3",
    //                             subTitle: "כותרת לרשימה:",
    //                             li1:"משפט ראשון ברשימה, זה לדוגמה משט יחסית ארוך משאר המשפטים ויש נקודה בסוף המשפט.",
    //                             li2:"משפט שני ברשימה",
    //                             li3:"משפט שלישי ברשימה",
    //                         }
    //                     ]
    //                 },
    //                 "נושא למידה 4": {
    //                     "תת תת נושא 12": [
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     // "תת תת נושא 23": [
    //                     //     {
    //                     //         cardType: "twoPics",
    //                     //         pic1: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         // subTitle1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         pic2: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //         // subTitle2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //     }
    //                     // ]
    //                 },
    //                 "נושא למידה 5": {
    //                     "תת תת נושא 12": [
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     // "תת תת נושא 23": [
    //                     //     {
    //                     //         cardType: "twoPics",
    //                     //         pic1: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         // subTitle1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         pic2: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //         // subTitle2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //     }
    //                     // ]
    //                 }
    //             },
    //         },
    //         "שיעור 2": {
    //             "learningContent": {
    //                 "נושא למידה 1": {
    //                     "כרטיסייה ראשונה מסוג טקסט": [ 
    //                         {
    //                             cardType: "text",
    //                             content: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים."
    //                         },
    //                         {
    //                             cardType: "textTwoParagraphs",
    //                             text1: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים.",
    //                             text2: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים. זוהי הפסקה השנייה של התוכן."
    //                         },
    //                         {
    //                             cardType: "textThreeParagraphs",
    //                             text1: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים.",
    //                             text2: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים. זוהי הפסקה השנייה של התוכן.",
    //                             text3: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים. זוהי הפסקה השלישית של התוכן."
    //                         }
    //                     ],
    //                     "כרטיסייה שנייה": [
    //                         {
    //                             cardType: "twoPics",
    //                             pic1: "../assets/images/pic.png",
    //                             content1: "דוגמה לכותרת לתמונה הראשונה",
    //                             pic2: "../assets/images/pic.png",
    //                             content2: "דוגמה לכותרת לתמונה השנייה"
    //                         },
    //                         {
    //                             cardType: "picAndText",
    //                             pic: "../assets/images/pic.png",
    //                             content: "דוגמה לכותרת לתמונה הראשונה",
    //                         }
    //                     ],
    //                     'כרטיסייה עם הרבה תוכן וגלילה': [
    //                         {
    //                             cardType: "pic_4titles_4text",
    //                             pic: "../assets/images/pic.png",
    //                             subTitle1: "כותרת ראשונה",
    //                             content1: "תשובה לכותרת הראשונה במשפט.",
    //                             subTitle2: "כותרת שנייה",
    //                             content2: "תוכן המפרט על הכותרת השנייה.",
    //                             subTitle3: "כותרת שלישית",
    //                             content3: "תוכן תוכן תוכן תוכן.",
    //                             subTitle4: "כותרת רביעית ואחרונה לכרטיסייה",
    //                             content4: "תשובה אחרונה לכותרת הרביעית. ניתן להוסיף עוד משפטים כמובן.",
    //                         },
    //                         {
    //                             cardType: "_3titles_3text",
    //                             subTitle1: "אפשרות לכותרות ותוכן בלי תמונות",
    //                             content1: "ולכל כותרת יש תוכן כמובן",
    //                             subTitle2: "כותרת שנייה",
    //                             content2: "תשובה לכותרת השנייה",
    //                             subTitle3: "כותרת שלישית ואחרונה",
    //                             content3: "תוכן אחרון לתת נושא זה. מוזמנים לעבור לתת נושא הבא!",
    //                         },
        
    //                     ],
        
    //                 },
    //                 "נושא למידה 2": {
    //                     "כרטיסייה שלישית מסוג וידאו": [
    //                         {
    //                             cardType: "video",
    //                             video: "../assets/images/פתיח.mp4"
    //                         },
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     "כרטיסייה רביעית": [
    //                         {
    //                             cardType: "text",
    //                             content: "מלא מילים של נושא ספיציפי, שנראה לי שייצא יפה אבל בואו נגלה יחדיו!"
    //                         }
    //                     ]
    //                 },
    //                 "נושא למידה 3": {
    //                     "תת תת נושא 12": [
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     "תת תת נושא 23": [
    //                         {
    //                             cardType: "list3",
    //                             subTitle: "כותרת לרשימה:",
    //                             li1:"משפט ראשון ברשימה, זה לדוגמה משט יחסית ארוך משאר המשפטים ויש נקודה בסוף המשפט.",
    //                             li2:"משפט שני ברשימה",
    //                             li3:"משפט שלישי ברשימה",
    //                         }
    //                     ]
    //                 },
    //                 "נושא למידה 4": {
    //                     "תת תת נושא 12": [
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     // "תת תת נושא 23": [
    //                     //     {
    //                     //         cardType: "twoPics",
    //                     //         pic1: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         // subTitle1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         pic2: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //         // subTitle2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //     }
    //                     // ]
    //                 },
    //                 "נושא למידה 5": {
    //                     "תת תת נושא 12": [
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     // "תת תת נושא 23": [
    //                     //     {
    //                     //         cardType: "twoPics",
    //                     //         pic1: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         // subTitle1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         pic2: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //         // subTitle2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //     }
    //                     // ]
    //                 }
    //             },
    //         },
    //     },
    // },

    "חוק ותמרורים": {
        "icon": "",
        "questions": [
            {
                type: "multiple",
                img: `../assets/images/image_example.jpg`,
                question: `11111 road`,
                ans1: `c`,
                ans2: `c`,
                ans3: `c`,
                ans4: `c`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                img: `../assets/images/imageee.jpg`,
                question: `2222 bird`,
                ans1: ``,
                ans2: ``,
                ans3: ``,
                ans4: ``,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                img: `../assets/images/imageee.jpg`,
                question: `4444444 also a bird`,
                ans1: ``,
                ans2: ``,
                ans3: ``,
                ans4: ``,
                correctAns: "ans2"
            },
            // {
            //     type: "binary",
            //     sentence: `333`,
            //     trueOrFalse: true
            // }
        ],
        "amountOfQuestions": 3,
        lessons: {
            //מצגת 1
            "הגדרת מושגים": {
                "learningContent": {
                    "הקדמה": {
                        "הקדמה": [ 
                            {
                                cardType: `text`,
                                content: `בפרק זה נגדיר מספר מונחים אותם עליך להכיר.
                                מטרתן של ההגדרות היא לתת תיאור מדויק ככל האפשר של מונחים מתחום התעבורה, כפי שהמחוקק התכוון אליהם. <br><br>
                                לעיתים יש הבדל בין ההגדרה "העממית" השגורה בפי כל, לבין ההגדרה "החוקית", כלומר ההגדרות שבפקודת התעבורה או בתקנות ומכאן חשיבותו של פרק זה. 
                                כך למשל, לא תהיה תמיד הגדרת "דרך" בתקנות, זהה למונח, כפי שהוא מוכר לך מחיי היומיום.`
                            }
                        ],
                    },
                    "כלי רכב": {
                        "כלי רכב הנעים בכביש" : [
                            {
                                cardType: `textTwoParagraphs`,
                                text1: `"<b>רכב</b>" – רכב הנע בכוח מכני או הנגרר על ידי רכב כזה או על ידי בהמה, וכן מכונה או מתקן, הנעים או הנגררים כאמור, כולל אופניים ותלת-אופן, ולמעט רכב ששר התחבורה פטר אותו בצו מהוראות פקודה זו כולן או מקצתן.`,
                                text2: `"<b>רכב נוסעים פרטי</b>" – רכב מנועי פרטי המיועד להסיע נוסעים אשר צוין ברישיון הרכב שלו סיווג אישי 1.M
                                שים לב – <b>רשות הרישוי</b> היא המגדירה את <b>סוג הרכב</b> ולא יצרן הרכב. כך למשל, ניתן לראות רכב המוגדר ברישיונו כ"רכב נוסעים פרטי", לצד אותו רכב בדיוק, שיוגדר ברישיונו כ"מונית". 
                                רשות הרישוי תגדיר לרוב רכב כ"רכב נוסעים פרטי", אם הוא מיועד להסיע על פי מבנהו עד 8 נוסעים, כולל על הנהג.`
                            },
                            {
                                cardType: `text`,
                                content: `"<b>כלי רכב מסחריים</b>" - יוגדרו על פי רוב באמצעות תיאור מפורט יחסית של מבנה הרכב. 
                                כך למשל יאופיין "טנדר" בכך שתתקיים הפרדה בין תא הנהג לבין תא המטען והוא ייקרא "רכב מסחרי בלתי אחוד", להבדיל מה-VAN  שיוגדר כ"רכב מסחרי אחוד".`,
                            },
                        ],
                    },
                    "כבישים ודרכים": {
                        "כביש" : [
                            {
                                cardType: `textTwoParagraphs`,
                                text1: `"<b>רכב</b>" – רכב הנע בכוח מכני או הנגרר על ידי רכב כזה או על ידי בהמה, וכן מכונה או מתקן, הנעים או הנגררים כאמור, כולל אופניים ותלת-אופן, ולמעט רכב ששר התחבורה פטר אותו בצו מהוראות פקודה זו כולן או מקצתן.`,
                                text2: `"<b>רכב נוסעים פרטי</b>" – רכב מנועי פרטי המיועד להסיע נוסעים אשר צוין ברישיון הרכב שלו סיווג אישי 1.M
                                שים לב – <b>רשות הרישוי</b> היא המגדירה את <b>סוג הרכב</b> ולא יצרן הרכב. כך למשל, ניתן לראות רכב המוגדר ברישיונו כ"רכב נוסעים פרטי", לצד אותו רכב בדיוק, שיוגדר ברישיונו כ"מונית". 
                                רשות הרישוי תגדיר לרוב רכב כ"רכב נוסעים פרטי", אם הוא מיועד להסיע על פי מבנהו עד 8 נוסעים, כולל על הנהג.`
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road1.png`,
                                content: `חלק הדרך המיועד לתנועת כלי הרכב, שנסלל או שופר לשם כך, או שתנועת כלי רכב נוהגת לעבור בו, למעט שולי דרך.
                                כלומר, כביש אינו בהכרח סלול אספלט.
                                די בכך <b>שתנועת כלי רכב נוהגת לעבור בו</b> על מנת שייחשב "כביש". על פי התקנות.
                                אין לנהוג בכביש ברכב המשמיע רעש בלתי סביר ורועש במיוחד.`},
                        ],
                        "כביש חד סטרי" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road2.png`,
                                content: `כל כביש שתנועת כלי רכב מותרת בו בכיוון אחד בלבד.
                                תנועה <b>בניגוד</b> לכיוון בדרך חד סטרית מותרת רק על פי <b> הוראת שוטר </b>, או <b> לרכב ביטחון בתפקיד</b>.`
                            },
                        ],
                        "שולי הכביש" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road3.png`,
                                content: `השטח שאין לצידו מדרכה <b>הסמוך לשפת הכביש</b>, עד לרוחב של שלושה מטרים או עד לקצה תעלת ניקוז, כאשר דופן התעלה מצוי פחות משלושה מטרים משפת הכביש. <br>
                                שול הכביש, יכול שהיה סלול, או לא, לעיתים יש הפרש גבהים בינו לבין הכביש, אולם הוא תחום בין שפת הכביש לבין תעלת הניקוז. אם המרחק בינה לבין שפת הכביש עולה על 4 מטר, אזי רק ארבעת המטרים הצמודים לשפת הכביש ייחשבו כ"שול" ( "שול – יחיד, שוליים" – רבים).`
                            },
                        ],
                        "שביל" : [
                            {
                                cardType: `picAndText`,
                                // חסרה תמונה
                                pic: `../assets/images/pics/road4.png`,
                                content: `דרך או חלק מדרך <b>שאינו כביש</b> שהוקצה לסוג עוברי דרך. <br>
                                כך למשל שביל להולכי רגל, או שביל לאופניים בלבד.`
                            },
                        ],
                        "נתיב" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road5.png`,
                                content: `חלק מרוחבו של כביש, בין שסומן ובין שלא סומן, המספיק לתנועת טור אחד של כלי רכב, למעט רכב הנע של שני גלגלים. <br>
                                כלומר, נתיב אינו מוגדר במטרים ואינו חייב להיות מסומן. <br> 
                                די בכך שיש מקום לתנועת טור אחד של כלי רכב ארבעה גלגליים, על מנת שיוגדר כנתיב. <br>
                                כמובן שאם קיים סימון בכביש, הרי הנתיב תחום ע"י הסימון.`
                            },
                        ],
                        "מעבר חצייה" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road6.png`,
                                content: `חלק מהכביש המסומן כמיועד לחצייתו על ידי הולכי רגל.`
                            },
                        ],
                        "שטח הפרדה" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road7.png`,
                                content: `כל מבנה, אי תנועה, סימון שטח על פני הדרך, גינה, שטח לא סלול וכיוצא באלה, <b>המחלקים את הדרך לאורכה</b>. <br>
                                שטח הפרדה כשלעצמו, יכול שיקבע באמצעות סימון בלבד ואינו חייב להיות בנוי אבן.`
                            },
                        ],
                        "שטח הפרדה בנוי" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road8.png`,
                                content: `שטח הפרדה המחלק את הדרך לאורכה באמצעות <b>התקן מוגבה מעל הכביש</b> כגון אבן מוגבהת, מעקה בטיחות או צמחיה. <br>
                                זהו שטח הפרדה המוכר לנו בשמו העממי "אי תנועה".<br>
                                שטח הפרדה, מחלק כביש דו סטרי, לשני כבישים חד סטריים. <br>
                                <b>תפקידו ליצור הפרדה בין כיווני תנועה מנוגדים</b>.<br>
                                <b>אסור</b> לחנות או לעצור בו ויש לנהוג תמיד מציידו הימני, אלא אם תמרור מורה אחרת.`
                            },
                        ],
                        "צומת" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road9.png`,
                                content: `הגדרת הצומת מחריגה שורת מפגשים של כבישים עם משטחים סלולים אחרים, דוגמת התמזגויות, כניסה לחצרות ולתחנות דלק ועוד. <br>
                                הסיבה לכך – תקנות רבות, עליהן נדון בהמשך, מטילות על הנהג חובות רבות בעת התקרבו לצומת ובעוברו בו. <br>כל אלה לא יחולו באותם האזורים שלא יוגדרו כ"צומת", ומכאן חשיבותה של ההגדרה.`
                            },
                        ],
                        "מחלף" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road10.png`,
                                content: `<b>מפגש של שני כבישים שלא באותו מפלס.</b> <br>
                                כלומר מפגש דרכים במפלסים שונים הכולל את הדרכים המחברות בין המפגש.`
                            },
                        ],
                        "מפגש מסילת רכבת" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road11.png`,
                                content: `מקום <b>שדרך ומסילת ברזל חוצים זו את זו במפלס אחד </b> והוא מסומן בתמרור שנקבע לכך.` },
                        ],
                        "קו עצירה" : [
                            {
                                cardType: `picAndText`,
                                // חסרה תמונה 
                                pic: `../assets/images/pics/road12.png`,
                                content: `קו לרוחב הכביש או בחלק מרוחבו, <b>המסמן גבול לשם עצירת רכב</b> סמוך לרמזור או לתמרור עצירה או לפני מפגש מסילת ברזל, או במקום שבו שוטר מכוון את התנועה.<br>
                                כלומר קו עצירה כשלעצמו, אינו מחייב עצירה. הוא מסמן לנהג היכן עליו לעצור, אם הוא נדרש לעשות כן, על פי <b> הוראה חוקית כלשהי </b> (כגון רמזור, תמרור וכו'). <br>
                                תמרור ייחשב "חוקי" ותקף אם הוצב כחוק, כלומר הצבתו אושרה על ידי רשות תמרור מרכזית , או רשות תמרור מקומית.`
                            },
                        ],
                        "אזור מיתון תנועה" : [
                            {
                                cardType: `picAndText`,
                                // חסרה תמונה 
                                pic: `../assets/images/pics/road13.png`,
                                content: `אזור שבו המהירות המרבית המותרת <b> אינה </b> עולה על <b> 30 קמ"ש </b> והוא מסומן בתמרור 222 בכניסה ואליו ו – 223 ביציאה ממנו.`
                            },
                        ],
                        "רחוב משולב" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road14.png`,
                                content: `דרך המיועדת <b>למשחקי ילדים, להולכי רגל ולרכב </b>ואשר בכניסה אליה הוצב תמרור המורה על רחוב משולב. <br>
                                עקרונית, רצוי להימנע ככל האפשר מנהיגה ברחוב כזה. אולם אם לא ניתן להימנע מנהיגה בו, יש לנהוג באופן <b>שלא יגרם סיכון לעוברי הדרך בה ולא תופרע פעילותם</b> של עוברי הדרך והילדים המשחקים במקום. <br>
                                מהירות הנסיעה המרבית המותרת ברחוב משולב – <b>30 קמ"ש</b>.`
                            },
                        ],
                    },
                    "רכבים": {
                        "רכב מיושן" : [
                            {
                                cardType: `picAndText`,
                                // חסרה תמונה
                                pic: `../assets/images/pics/road15.png`,
                                content: `רכב ישן, נקרא בלשון המחוקק "רכב מיושן", אולם לא כל רכב שהיה מכונה כך בלשון העם, יוגדר כזה על ידי המחוקק:
                                <br>
                                "<b>רכב מיושן</b>" –
                                <ol>
                                <b><li>רכב</b>, למעט טרקטור, גרור או אוטובוס, שבמועד חידוש רישיונו, <b>מלאו 19 שנים</b> משנת ייצורו. </li>
                                <li> <b>אוטובוס</b> שממועד חידוש רישיונו <b>מלאו 15 שנים</b> משנת ייצורו.
                                </li>
                                </ol>`
                            },
                        ],
                        "רכב שטח" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road16.png`,
                                content: `רכב מנועי המיועד לפני מבנהו לנוע <b>בדרכי עפר בלבד</b>, ומתקיימים בו אלה:
                                <ul>
                                <li> נע על <b>4 גלגלים לפחות</b>.
                                <li> נפח מנועו אינו עולה על 750 סמ"ק.
                                <li> משקלו העצמי <b>אינו</b> עולה על 750 ק"ג.
                                <li> ההיגוי שבו נעשה באמצעות <b>הגה</b>.
                                <li> הוא <b>צוין ברישיון הרכב כרכב שטח</b>.
                                </ul>`
                            },
                        ],
                        "רכב בטחון" : [
                            {
                                cardType: `text`,
                                content: `<b>רכבי הבטחון הם:</b> <br>
                                אמבולנס של מגן דוד אדום, או אמבולנס שניתן לגביו אישור על היותו רכב בטחון מאת מנהל משרד הבריאות או מטעמו, אופנוע להגשת עזרה ראשונה רכב של משטרת ישראל או של צבא הגנה לישראל, רכב לכיבוי שריפות ורכב אחר שאושר על ידי רשות הרישוי כרכב בטחון, כשהם <b>מפיצים בפנס מיוחד אור </b>מהבהב אדום, כחול או אדום-כחול <b>ומשמיעים את האזעקה בסירנה </b>.`
                            },
                            {
                                cardType: `pics`,
                                pic1: `../assets/images/pics/car1.png`,
                                pic2: `../assets/images/pics/car2.png`,
                                pic3: `../assets/images/pics/car3.png`,
                            },
                        ],
                        "רכב תפעולי" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car8.png`,
                                content: `כלי רכב המשמשים על פי רוב לעבודה. רכב תפעולי אינו מוגדר כרכב פרטי, או ציבורי, חלות עליו מגבלות מיוחדות וככלל, הוא <b>רשאי לנוע רק באזורים מוגדרים</b> המכונים "איזור רכב תפעולי". <br>
                                כך למשל כלי רכב ייעודים הנעים בנמלי אוויר, נמלי ים וכו'.`
                            },
                        ],
                        "מכונה ניידת" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car4.png`,
                                content: `רכב מנועי שלפי מבנהו <b>מיועד לביצוע עבודות</b> ואינו מיועד לגרירה.`
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car5.png`,
                                content: `"מלגזה" – מכונה ניידת בעלת תורן או זרוע שליפה, שלהם מחובר מזלג או התקן אחר המיועדים להרמה ולשינוע של משאות, אשר צוינה ברישיונה כמלגזה.`
                            },
                        ],
                        "טרקטור" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car6.png`,
                                content: `רכב מנועי המיועד לפי מבנהו <b>לגרירה</b> או <b>לגרירה ולביצוע עבודות</b>, שצוין ברישיון הרכב כטרקטור. `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road.png`,
                                content: `"<b>טרקטור משא</b>" – טרקטור שנתקיימו בו כל אלו:
                                <ul>
                                <li>נע על <b>4 גלגלים לפחות</b>. </li>
                                <li>משקלו הכולל המותר <b>לא עולה על 1,500 ק"ג</b>. </li>
                                <li> ההיגוי שבו נעשה באמצעות <b>ההגה</b>. </li>
                                <li> מצויד <b>בדיפרנציאל</b> </li>
                                <li> <b>בעל משטח הטענה</b> שהרכיב היצרן בתהליך ייצורו, המיועד לגרירה ולהובלת טובין. </li>
                                <li>צוין ברישיון הרכב כטרקטור משא. </li>
                                </ul>`
                            },
                        ],
                       "טרקטורון" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road16.png`,
                                content: `טרקטורון הוא טרקטור <b>שנתקיימו בו כל אלה</b>:
                                <ul>
                                <li>הוא נע על <b> 4 גלגלים לפחות</b>.</li>
                                <li>אופן הישיבה עליו הוא כשרגלי הנהג <b>משני צידי המושב</b>.</li>
                                <li>ההיגוי בו נעשה באמצעות<b> כידון</b>.</li>
                                <li>הוא <b>צוין ברישיון</b> הרכב כטרקטורון. </li>
                                </ul>`
                            },
                        ],
                        "רכב איטי" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car8.png`,
                                content: `רכב מנועי שלגביו נקבעה מהירות מקסימלית שאינה עולה על<b> 40 קמ"ש </b>על ידי רשות הרישוי ברישיונו של הרכב או בתקנות אלה.`
                            },
                        ],
                        "משקל כולל מותר" : [
                            {
                                cardType: `twoPicsAndText`,
                                pic1: `../assets/images/pics/car10.png`,
                                pic2: `../assets/images/pics/car11.jpg`,
                                content: `המשקל העצמי בתוספת משקל האנשים והמטען <b>שהתירה רשות רישוי לרכב הנדון</b> להסיע או להוביל. <br>
                                "<b>משקל עצמי</b>" – משקל הרכב ללא מטען וללא נהג, לרבות משקל כל אבזרי הרכב ומשקל הדלק, המים והשמן שבו. `
                            },
                        ],
                        "מושב בטיחות" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/chair.png`,
                                content: `מושב הרתום לרכב באמצעות חגורת בטיחות <b>המיועד להסעת ילדים </b> ברכב, שמותקנות בו חגורות המיועדות לרתימת הילד אליו, העומד בתקן. <br>
                                על מנת לפשט – מושב הבטיחות עצמו – לא הילד היושב עליו – <b>מעוגן למושב הרכב הרגיל </b>, באמצעות חגורות הבטיחות הרגילות שברכב. בנוסף, מותקנות במושב הבטיחות חגורות, המיועדות <b> לרתום אליו את הילד </b> המוסע בו.`
                            },
                        ],
                        "מושב מגביה" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road.png`,
                                content: `מושב המיועד להסעת ילדים <b>בגילאי 3 עד 8</b> ברכב כשהילד היושב אליו רתום בחגורת הבטיחות של הרכב והעומד בתקן. <br>
                                בניגוד ל"מושב הבטיחות", אין במושב זה חגורות מיוחדות – זהו מושב המיועד להסעת ילדים גדולים יותר, המאפשר לחגור ילדים אלה בחגורות הבטיחות הרגילות של הרכב, באמצעות הגבהת המושב המקורי שברכב.`
                            },
                        ],
                    },
                    "השפעות חיצוניות": {
                        "זמן תאורה" : [
                            {
                                cardType: `text`,
                                content: `זמן הלילה וכן זמן אחר שבו הראות לקויה מחמת תנאי מזג האוויר, או מחמת סיבות אחרות.
                                זהו הזמן שבו נדרש הנוהג <b>להדליק אורות ברכב</b>.<br> 
                                הנהג נדרש להדליק את אורות הרכב, לא רק בלילה, אלא לעיתים גם בשעת הצהריים, למשל עקב קיומם של תנאי ראות לקויים. כך למשל <b> מחייבות התקנות הדלקת אורות בחורף, בין 1 נובמבר ועד 31 במרץ</b> בכל שנה.`
                            },
                        ],
                        "לילה" : [
                            {
                                cardType: `text`,
                                content: `פרק הזמן שבין תום רבע שבע <b>לאחר שקיעת השמש</b> לבין תחילת רבע שעה לפני זריחתה. <br>
                                הסבר פשוט – גם לאחר ששקע גלגל השמש, קיימת תאורה מספקת ואין עדיין צורך בהדלקת אורות. רק רבע שעה מאוחר יותר, נעשה חשוך ואז מתחיל ה"לילה" במובנו התחבורתי. <br>כך גם בבוקר – גם לאחר שעלה גלגל השמש, עדיין חשוך וה"לילה" התחבורתי נמשך ואסור עדיין לנהוג ללא אורות. רק רבע שעה מאוחר יותר, משעולה השחר והתאורה הופכת לחזקה יותר, ניתן לכבות את האורות. `
                            },
                        ],
                        "עמעום" : [
                            {
                                cardType: `text`,
                                content: `כיבוי אור הדרך בפנסי החזית, והדלקת אור המעבר, כשמשמעותם בתקנה. <br>
                                עקרונית מצויד הרכב בשלושה סוגי אורות:
                                <ul>
                                <li>אור חניה, המיועד לחניה בלבד ולא לנסיעה. 
                                <span><img class="sml-pic" src="../assets/images/pics/light1.png"/></span>
                                </li>

                                <li> אור נמוך. 
                                <span><img class="sml-pic" src="../assets/images/pics/light2.png"/></span>
                                </li>

                                <li> אור דרך ("האור הגבוה"). 
                                <span><img class="sml-pic" src="../assets/images/pics/light3.png"/></span>
                                </li>
                                </ul>

                                <b>ה"עמעום" מחליף את אור הדרך באור נמוך.</b>`
                            },
                        ],
                        "עוברי הדרך" : [
                            {
                                cardType: `text`,
                                content: `לא רק לנהגים לעשות שימוש בדרך, אלא גם להולכי רגל, לרוכבי אופניים, נוהגי בעלי חיים וכו'. כל הנ"ל מכונים בשם הכללי "עוברי דרך" והם מוגדרים באופן הבא: <br>
                                <b>"עובר דרך</b>" – המשתמש בדרך לנסיעה, להליכה, לעמידה, או לכל מטרה אחרת.`
                            },
                        ],
                        "מתן זכות קדימה" : [
                            {
                                cardType: `text`,
                                content: `אי-המשכת הנסיעה או התחלתה כאשר על ידי כך הנהג ברכב הנדרש לתת זכות קדימה לנוהגים ברכב אחר לאלצם לסטות מקו נסיעתם או לשנות את מהירות נסיעתם.`
                            },
                        ]
                    }
                },
            },
            // מצגת 2
            "רישיונות והיתרים": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `text`,
                                content: `בפרק זה נסקור מספר הנחיות כלליות הנוגעות לשימוש ברכב ואשר חלות על בעליו של הרכב, על מי השליטה ברכב נמצאת בידו וכמובן על נהג הרכב. <br>
                                כמו כן נסקור את סמכויותיה של רשות הרישיוי, בכל הנוגע ליחסים שבינה לבין בעלי רישיונות נהיגה ובעלי רכב. `
                            },
                        ],
                    },
                    "רשות הרישוי": {
                        "רשות הרישוי" : [
                            {
                                cardType: `text`,
                                content: `הגוף היחידי הרשאי להנפיק רישיון נהיגה ורישיון רכב הוא <b>רשות הרישוי</b>, והיחיד שיכול לשנות אותם. <br>
                                הנהג עצמו אינו רשאי לבצע שום שינוי ברישיון הנהיגה או רישיון הרכב. <br>
                                רשות הרישוי היא גם היחידה הרשאית להנפיק " <b> רישיון סחר </b> " וזאת לצורך בדיקת רכב לקראת קנייתו. <br>
                                במקרים של שינוי מסוים במצב בריאותו של הנהג (מחלת לב, מגבלות במערכת העצבים, העצמות, הראיה והשמיעה), חייב הנהג להודיע על השינוי לרשות הרישוי בתוך 15 ימים מהרגע שקרה.
                                `
                            },
                            {
                                cardType: `text`,
                                content: `<b>לרשות הרישוי סמכויות נוספות כגון:</b>
                                <ol>
                                <li>קבלת דיווחים בדבר עבירות שביצעו נהגים. <b>חשוב לזכור</b> – כל נהג רשאי לדווח לרשות הרישוי על עבירות שביצע נהג אחר, אולם רשות הרישוי תקל דיווח כזה, רק אם מדובר בסוג מסוים של עבירות ובתנאי שהנהג המתלונן נכח בעצמו בעת ביצוע העבירה. </li>
                                <li>מתן אישור להסעת נוסעים בשכר ברכב פרטי (באמצעות "הוראת שעה").</li>
                                <li>להזמין נהג לבירור ולהוסיף תנאים ברישיון הנהיגה שלו.</li>
                                <li>לזמן נהגים לעבור השתלמות או הדרכה בנהיגה.</li>
                                </ol>`
                            },
                            {
                                cardType: `text`,
                                content: `<ol start="5">
                                <li>לזמן רכב לביצוע<b> בדיקה טכני </b>. סמכות זו נתונה גם לבוחן של <b>משטרת ישראל</b>. בוחנים אלה, רשאים גם למסור לנהג "הודעת אי שימוש" ברכב, אם הם מוצאים בבדיקה, כי הרכב מסכן את התנועה.</li>
                                <li>לאשר העברת בעלות ברכב, כשהיא נוכחת ששולם כל מס ואגרה וכן כי הרכב אינו מעוקל או משועבד. <b>יש לזכור</b> - החובה לדאוג להעברת הבעלות על רכב בעת מכירתו, חלה על <b>בעל הרכב</b> (לא על הקונה ולא על רשות הרישוי, שרק מאשרת את העברת הבעלות, אך אינה יוזמת אותה). </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `<ol start="7">
                                <li> לאשר לנהג <b>להקפיא</b> את רישיון הרכב – אם מספיק בעל הרכב לעשות שימוש ברכבו למשך תקופה העולה על חודש ימים, עליו להודיע על כך לרשות הרישוי.
                                </li>
                                </ol>
                                `
                            },
                        ],
                    },
                    "רישוי נהגים": {
                        "מי יכול להוציא רישיון נהיגה?" : [
                            {
                                cardType: `text`,
                                content: `עקרונית, זכותו של כל אדם לקבל רישיון נהיגה לרכב. <br>
                                יוצאים מן הכלל הם אנשים שהתגלו אצלם ליקויי בריאות כשמתגלים ליקויים בריאותיים אצל בעלי רישיון נהיגה, מוסמכת רשות הרישוי לפסול את רישיונם של אנשים אלה.
                                `
                            },
                        ],
                        "גיל מינימלי לקבלת רישיון" : [
                            {
                                cardType: `text`,
                                content: `
                                הגיל המינימלי לקבלת רישיון נהיגה, משתנה בהתאם <b>לסוג הרכב</b> בו מדובר:
                                <ul>
                                <li>על מנת לנהוג <b>בטרקטורון</b>, <b>טרקטור ומכונה ניידת</b>, יש צורך בקבלת רישיון נהיגה דרגה 1, שהגיל המינימלי לקבלתו הוא <b>16</b>.
                                </li>
                                <li>על מנת לנהוג ברכב נוסעים <b>פרטי</b> וברכב <b>מסחרי</b> שמשקלו הכולל המותר לא עולה על 3,500 ק"ג, יש צורך ברישיון נהיגה מדרגה B, שהגיל המינימלי לקבלתו הוא <b>16 ו-9 חודשים</b>. בעל רישיון נהיגה מדרגה B רשאי גם לגרור גרור, שמשקלו עד 1,500 ק"ג.
                                </li>
                                <li>על מנת לנהוג ברכב <b>ביטחון</b>, או רכב <b>חילוץ</b>, יש צורך <b>בהיתר מיוחד</b>, הניתן ע"י רשות הרישוי.
                                </li>
                                </ul>
                                `
                            },
                        ],
                    },
                    "רישיון נהיגה ומסמכים": {
                        "נהיגה ברכב" : [
                            {
                                cardType: `text`,
                                content: `אדם רשאי לנהוג ברכב, רק אם יש לו <b>רישיון נהיגה תקף</b> לאותו סוג רכב ובהתאם למגבלות המצוינות ברישיון הנהיגה, (אם וככל שמצוינות כאלה). <br>
                                כך למשל, אם צוינה מגבלה המחייבת הרכבת משקפיים, או עדשות מגע בעת נהיגה, אין לנהוג בלעדיהן. <br>
                                יתירה מזאת, גם לבעל רכב, או למי שהשליטה ברכב בידיו, <b>אסור</b> לאפשר לאחר לנהוג, אם הוא יודע שאין בידי האחר רישיון נהיגה תקף לאותו סוג רכב.
                                `
                            },
                            {
                                cardType: `text`,
                                content: `הגדרת "נהיגה" - אדם הדוחף רכב ייחשב כמי שנוהג בו לכל עניין הקשור בחובת הציות לדיני התעבורה. כל למשל, אסור לאדם שאין לו רישיון נהיגה לאופנוע, להסיע אופנוע בכוח הגוף.`
                            },
                        ],
                        "מסמכים" : [
                            {
                                cardType: `text`,
                                content: `בעת הנהיגה חייב נהג להחזיק ברשותו <b>רישיון רכב תקף ותעודת ביטוח חובה תקפה ומשולמת</b>, כשהמסמכים במצב תקין, נקי וקריא. <br>
                                עקרונית, <b>אין</b> להסתפק בתצלום בלבד, אלא אם כן מדובר ברכב השייך לחברה, שבה קיים קצין בטיחות, המאשר בחתימתו ובחותמו את תפוקתם של המסמכים המצולמים.`
                            },
                            {
                                cardType: `text`,
                                content: `בעת הוצאת רישיון רכב, או בעת חידושו של רישיון כזה, נדרש הנהג להציג תעודת ביטוח תקפה, גם בפני רשות הרישוי (או מכון הרישוי, בו מבוצע המבחן השנתי ואשר משמש כנציגה של רשות הרישוי לעניין זה).
                                `
                            },
                        ],
                    },
                    "סמכויות שוטרים וקציני משטרה": {
                        "פסילה מנהלית" : [
                            {
                                cardType: `text`,
                                content: `
                                ישנם מקרים, בהם רשאי קצין משטרה <b>לפסול</b> מנהלית את רישיון הנהיגה:
                                <ol>
                                <li>לתקופה בת <b>30</b> יום – אם הנהג ביצע עבירה שיש בה <b>סיכון הולך רגל במעבר חציה</b>.
                                </li>
                                <li>לתקופה בת <b>60</b> יום – אם היה הנהג <b>מעורב בתאונה</b> בה נגרמה <b>חבלה לאדם או שנגרם נזק לרכוש</b>.
                                </li>
                                <li>לתקופה בת <b>90</b> יום – אם היה הנהג <b>מעורב בתאונות דרכים</b>, שבה נהרג אדם</b>.
                                </li>
                                </ol>
                                `
                            },
                        ],
                        "הודעת אי שימוש ברכב מסחרי" : [
                            {
                                cardType: `text`,
                                content: `כשמדובר ברכב מסחרי ושוטר מגלה בבדיקה כי מובל מטען שמשקלו עולה על המותר, רשאי השוטר למסור לנהג "<b>הודעת איסור שימוש</b>" ברכב ולקחת מהנהג את רישיון הנהיגה שלו, כל זאת למשך <b>30</b> יום. <br>
                                אם זו הודעה שניה בתוך תקופה של 3 שנים תארך תקופת האי שימוש 60 יום. <br>
                                זכור: נהג שייתפס נוהג בעת <b>שלילה</b>, עלול לשלם על כך עד <b>3 שנות מאסר בפועל</b>.
                                `
                            },
                        ],
                    },
                    "נהג חדש": {
                        "חובות הנהג חדש" : [
                            {
                                cardType: `text`,
                                content: `בשנתיים הראשונות לנהיגתו, נחשב נוהג רכב ל"נהג חדש". בתקופה זו (ובכל עת אחרת בה הוא מוגדר כ"נהג חדש"), חייב נהג להצמיד <b>תווית "נהג חדש"</b> לשוליו התחתונים של חלון הרכב האחורי, כך שתיראה ע"י הנוהג מאחוריו. <br>
                                בשלושת החודשים הראשונים לנהיגתו, חייב נהג חדש לנהוג <b>בליווי מלווה היושב במושב שלצד הנהג</b>, שבידו רישיון נהיגה לאותו סוג רכב בו הנהג החדש נוהג. 
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/sign1.png`,
                                content: `נוהג חדש, שגילו צעיר מ-21 אינו רשאי להסיע יותר מ-2 נוסעים (אלא אם נמצא ברכב מלווה).
                                `
                            },
                        ],
                        "מלווה לנהג חדש" : [
                            {
                                cardType: `text`,
                                content: `
                                המלווה, אם אינו מורה נהיגה, <b>חייב להיות אדם העונה על אחת מהאפשרויות הבאות</b>: 
                                <ol>
                                <li>בן 24 שנים ויש בידו רישיון נהיגה לאותו סוג רכב, 5 שנים לפחות.
                                </li>
                                <li>בן 30 שנים ויש בידו רישיון נהיגה לאותו סוג רכב, 3 שנים לפחות.
                                </li>
                                </ol>
                                `
                            },
                        ],
                    },
                    "הכניסה לרכב והנסיעה": {
                        "תקינות הרכב" : [
                            {
                                cardType: `text`,
                                content: `ככלל, אין לנהוג ברכב שאינו תקין, או ברכב ששדה הראיה שלו בו מוגבל. 
                                החריג לכך – אם ההגבלה קלה וזניחה. <br>
                                ברכב שלא ניתן לראות מבעד לשמשה האחורית שלו, יש להתקין מראות תשקיף מציידי הרכב.<br>
                                כשהרכב חונה בציידו הימני של הכביש ויש להתקדם על הכביש לקראתו, עדיף להתקרב אליו מלפנים, אל מול פני התנועה המתקרבת.
                                `
                            },
                        ],
                        "נסיעה חדשה" : [
                            {
                                cardType: `text`,
                                content: `
                                לפני תחילת כל נסיעה, על הנהג לוודא קיומם של אביזרים מסוימים ברכב:
                                <ol>
                                    <li><b>גלגל חלופי ומגבה</b> (חייבים להימצא בכל רכב הנע על גלגל גומי, למעט טרקטור, תומך ומכונה ניידת שמשקלה עולה על 400 ק"ג). 
                                    </li>
                                    <li><b>משולש אזהרה</b> (חייב להימצא בכל רכב מנועי למעט אופנוע) וכן בנתמך, <b>אפוד זוהר</b>.
                                    </li>
                                    <li><b>מטף לכיבוי אש</b> (חייב להימצא בכל רכב מנועי, למעט רכב נוסעים פרטי, טרקטור ואופנוע).
                                    </li>
                                    <li><b>סל אשפה</b> (חייב להימצא בכל רכב נוסעים פרטי).
                                    </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol start="5">
                                <li>לבדוק את <b>תקינות הפנסים</b>, השמשות והמגבים ואת ניקיונם. אם אחת מנורות הרכב אינה מאירה, יש להחלפה ולוודא שהנתיך הקשור אליה תקין.
                                </li>
                                <li>לבדוק את <b>הנוזלים והשמנים</b> ברכב, (שמן מנוע, נוזל קירור, נוזל ניקיון השמשות).
                                </li>
                                <li>לבדוק את <b>לחצי האוויר בצמיגים</b>, כולל בצמיג החלופי.
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `שימו לב - יש לנהוג ברכב <b>רק במידה והנהג מכיר את הרכב ואת מערכותיו השונות</b>.  <br>
                                אם זו הפעם הראשונה בה הנך נכנס לרכב מסוים חובה עליך להכיר היטב את מערכות התפעול, לפני תחילת הנסיעה. הכרה ובקיאות במערכות הרכב חיונית. מי שחייב משקפיים, או בעדשות מגע, </b>חייב להרכיבם</b> בכל עת שהוא נוהג ברכב. 
                                `
                            },
                        ],
                        "כיוון המושבים" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/seats1.png`,
                                content: `יש לכוון את מושב הנהג, כך שיתאים למידות גופך ואת משענת הראש, כך שיוכל לתמוך בראשך בעת פגיעה מאחור. כך תוכל להגיע בנוחות אל ההגה, הדוושות ושאר מנופי התפעול ותקבל שדה ראיה מרבי, תפעול נוח ויעיל של מערכות הרכב ונהיגה מעייפת פחות.
                                הקפד על מרחק מתאים מההגה. <br>
                                
                                אחיזה נכונה על ההגה, תאפשר תנועה נכונה של הידיים והפעלה מדויקת של ההגה בסטיות, בעקומות ובפניות.
                                `
                            },
                        ],
                        "כיוון המראות" : [
                            {
                                cardType: `text`,
                                content: `כוון את מראות הרכב, כך שתוכל לצפות באמצעותן בשטח <b>שמאחורי הרכב ומצידיו</b>. במראה הפנימית עליך לראות את השטח הנשקף מבעד לשמשה האחורית ובהתאם לסוג המראה (פנורמית, או רגילה), לעיתים גם מעט מהשטח שמאחור ומימין. <br>
                                זכור – <b>מראה פנורמית מעוותת את המרחקים הנצפים באמצעותה</b>. המרחקים נראים גדולים מאשר במציאות. את המראות יש לכוון כך, שתוכל לצפות באמצעותן בשטחים הצמודים לדופן הרכב, ובשטח שמימין (או משמאל) לשטח זה, בהתאמה. 
                                `
                            },
                        ],
                        "דליפת גזים מהרכב" : [
                            {
                                cardType: `text`,
                                content: `רכב ממנו דולפים גזים הוא <b>מסוכן</b>, כיוון שגזים שייפלטו ממערכת זו עלולים לחדור לתא הנהג ולסכן את הנהג והנוסעים. מכאן גם, <b>שהשארת מנוע פועל בחניון סגור מסוכנת ביותר</b> שכן אין לגזים הרעילים הנפלטים ממנוע הרכב לאן לצאת הם מסכנים את הנהג והנוסעים ברכב.`
                            },
                        ],
                        
                    },
                    "מצב גופני ונפשי": {
                        "מצב גופני ונפשי" : [
                            {
                                cardType: `text`,
                                content: `במידה והנוהג ברכב נמצא במצב גופני או נפשי המונע ממנו שליטה מלאה ברכב, או שהוא עלול לסכן את עצמו או אנשים אחרים בדרך – <b>חל איסור על אותו נהג לנהוג!</b>
                                לדוגמה: לאחר נטילת תרופות הגורמות לקהות חושים, או לתחושת עייפות ונמנום, יהיה מותר לנהוג ברכב רק לאחר שפגה <b>לחלוטין</b> השפעת התרופה.
                                `
                            },
                        ],
                        "עייפות" : [
                            {
                                cardType: `text`,
                                content: `עייפות בנהיגה הינה תופעה מוכרת. שעות רבות של נהיגה רציפה, עלולות לגרום לעייפות, נמנום, חוסר ריכוז והתארכות זמן התגובה. <br>
                                במקרים אלה חל איסור מוחלט על הנהיגה ברכב. <br>
                                אם הדבר קורה באמצע הדרך, חובה על הנהג <b>לעצור</b> ל"עצירת רענון" <b>במקום המותר לעצירה ולחניה</b>, 
                                לבצע פעילות גופנית כלשהי, לנוח ולהרבות בשתייה, על מנת להפיג את העייפות הזמנית. <br>
                                יחד עם זאת יש לזכור – זהו פתרון זמני בלבד. עייפות אמתית נגמרת רק בעזרת שינה. ולא ניתן לנהוג במצב עייפות.
                                `
                            },
                        ],
                    },
                    "לפני היציאה לדרך": {
                        "השתלבות לכביש" : [
                            {
                                cardType: `text`,
                                content: `הדרך הבדוקה להימנע מתאונה, בעת ההשתלבות בתנועה, הינה בדיקה מוקדמת של מצב התנועה והערכה נכונה של מהירות ההשתלבות הנדרשת. <br>
                                יש להמתין בסבלנות עד להיווצרות מרווח מספיק ורק אז, לאותת ולהשתלב בתנועה תוך התאמת המהירות למהירות התנועה.
                                `
                            },
                            {
                                cardType: `text`,
                                content: `הערה חשובה לעניין האיתות – איתות כשלעצמו <b>אינו</b> מתיר לנהג לצאת לכביש. האיתות רק מסמן לשאר עוברי הדרך על כוונת הנהג, אך אין הוא מקנה זכות אוטומטית להתחיל בנסיעה. זכות כזו נרכשת רק באמצעות <b>הסתכלות, בדיקת השטח ווידוא כי ניתן לצאת לכביש בבטיחות</b>. 
                                `
                            },
                            {
                                cardType: `text`,
                                content: `אין לנהוג ברכב שרק יד אחת אוחזת בהגה או בכידון הרכב, אלא לשם ביצוע פעולה הנדרשת לנהיגה, כגון הפעלת מנוף האיתות, שילוב הילוך וכו'. <br>אין גם לעשות שימוש במכשיר טלפון סלולארי, שלא באמצעות מיקרופון המותקן ברכב ("דיבורית"), או לחילופין אם הטלפון עצמו מצויד בדיבורית, יש להניחו ברכב באופן יציב, כך שלא יוכל להישמט ממקומו. <br>ובאותו העניין – <b>חל איסור על משלוח מסרונים (SMS) וקבלתם בעת נהיגה</b>, או בעת המתנה <b>בתמרור "עצור"</b>, או <b>ברמזור אדום</b>.
                                `
                            },
                        ],
                    }
                }
            },
            //מצגת 3
            "הנחיות כלליות לגבי תמרור": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `text`,
                                content: `בפרק זה נסקור מספר הנחיות כלליות הנוגעות לדרישות המחוקק לעניין אופק הציות הנדרש מנהגים <b>להוראות והנחיות הניתנות להם ע"י מערכת התמרור</b>. <br>הציות להוראות.
                                `
                            },
                        ],
                    },
                    "שוטרים ותמרורים": {
                        "ציות להוראות בכביש" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/piramid1.png`,
                                content: `נהג וכל משתמש אחר בדרך, חייבים לציית להוראות הניתנות ע"י <b>שוטר, רמזור, תמרור, או סימון בכביש</b>, אולם קיים מדרג המסדיר את ההירארכיה בין כל הגורמים הללו:
                                `
                            },
                            {
                                cardType: `text`,
                                content: `סימונים בכביש, כגון נתיבים, סימון שטחי הפרדה, קו עצירה וכדומה <b>מחייבים את הנהג</b>. כך למשל, חל <b>איסור</b> לנסוע על גבי שטח הפרדה מסומן. <br>
                                דוגמה נוספת- בעת הכניסה לצומת מנתיב מסוים, יש להמשיך בנסיעה בו גם בתוך הצומת, עד ליציאה ממנו.אולם תמרור "כוחו" גדול מכוחו של סימון בכביש. כך למשל מסמן קו עצירה את המקום בו נדרש נהג לעצור, קו העצירה כשלעצמו, אינו מחייב עצירה, אולם בשעה שהוא מסומן ליד תמרור "עצור", הרי שהתמרור, הוא <b>המורה לנהג לעצור</b> ואילו קו העצירה, רק מורה לו <b>היכן לעצור</b>.
                                `
                            },
                        ],
                        "רמזורים" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/3_2.jpg`,
                                content: `<b>הוראות הרמזור</b> גוברות על הוראות התמרור (למעט רמזור צהוב מהבהב המציין תקלה). 
                                `
                            },
                            {
                                cardType: `text`,
                                content: `במרבית הצמתים המרומזרים מוצבים תמרורי "עצור" (לפחות) משני צידיו של הצומת. <br>
                                מטרתם להסדיר את <b>סדר הכניסה לצומת</b> ואת <b>כללי מתן זכות הקדימה בו</b>, בעת שהרמזורים אינם פועלים. <br>
                                אולם בשעה שהרמזורים פועלים והאור הנדלק ברמזור הוא ירוק, רשאי הנהג לחצות את הצומת מבלי לעצור תחילה, למרות קיומו של תמרור "עצור", כלומר הוראות הרמזור גוברות במקרה זה על הוראות התמרור.
                                `
                            },
                        ],
                        "שוטר בצומת מרומזר" : [
                            {
                                cardType: `text`,
                                pic: `../assets/images/pics/police1.jpg`,
                                content: `הוראות השוטר המכוון בצומת, גוברות על כל אלה גם יחד. נהג <b>חייב לציית להוראות שוטר</b>, גם אם הן מנוגדות להוראות הרמזור, תמרור, או סימון בכביש. 
                                `
                            },
                            {
                                cardType: `text`,
                                content: `<b>כיצד נדע מיהו שוטר?</b> 
                                אם הוא לבוש מדים, או שהוא מזדהה באמצעות תעודת מינוי מתאימה, הרי שזהו שוטר שיש לציית להוראותיו. לעניין זה, גם שוטר צבאי הוא שוטר שיש לציית להוראותיו, אולם רק בשעה שהוא <b>במדים ובתפקיד</b>. <br>
                                מכאן ברור, שגם שוטר צבאי במדים, המורה לנהג לנסוע בניגוד להוראת תמרור, יש לציית להוראותיו, שכן הוראותיו גוברות על הוראות התמרור.
                                `
                            },
                        ],
                        "בעלי תפקידים נוספים" : [
                            {
                                cardType: `text`,
                                content: `החוק מכיר בעובדה שלעיתים, יש צורך לציית גם לבעלי תפקידים אחרים, המכוונים את התנועה, לרוב באופן <b>זמני ולמטרה מסוימת</b>. לכן הוא קובע שיש לציית גם להוראותיו של <b>פקח עירוני</b>, אלא שבניגוד לשוטר אזרחי רגיל, חלה חובה זו רק בשעה שהוא לובש מדים ואם הוא הוסמך כדין לתפקידו. <br>
                                ברור מכאן, שהוראותיו של <b>פקח</b> במקרה כזה, גוברות גם על הוראותיו של תמרור. במקרים מסוימים, יש גם חובה לציית להוראותיו של <b>עובד מע"צ </b>- עליו להיות לבוש מדים והוראותיו צריכות להינתן רק לצרכי הכוונת התנועה.
                                `
                            },
                        ],
                    },

                    
                    "": {
                        "" : [
                            {
                                cardType: `text`,
                                content: ``
                            },
                        ],
                    },
                }
            }
        }
    },

    // "בטיחות": {

    // },
    // "הכרת הרכב": {

    // },
    // "רכב משא": {

    // },
}




/********************************************************************************************************/
/********************************************************************************************************/
/********************************************************************************************************/
/*****  אובייקטים לפי סוג הכרטיסייה המכניסים את התוכן של כל כרטיסייה אל תוך הכרטיסייה  ********/

/**
 * @type {{[index: string]: {init: (card: HTMLElement, json: any) => void}}}
 */
let CARD_TYPES = {};

CARD_TYPES.text = {
    init(card, json) {
        card.querySelector(".content").innerHTML = json.content;
    }
}

CARD_TYPES.textTwoParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
    }
}

CARD_TYPES.textThreeParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
        card.querySelector(".text3").innerHTML = json.text3;
    }
}

CARD_TYPES.picAndText = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.twoPics = {
    init(card, json) {
        card.querySelector(".pic1").src = json.pic1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".pic2").src = json.pic2;
        card.querySelector(".content2").innerHTML = json.content2;
    }
}
CARD_TYPES.video = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
    }
}
CARD_TYPES.videoAndText = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.pic_4titles_4text = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
        card.querySelector(".sub-title4").innerHTML = json.subTitle4;
        card.querySelector(".content4").innerHTML = json.content4;
    }
}
CARD_TYPES._3titles_3text = {
    init(card, json) {
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
    }
}

CARD_TYPES.list3 = {
    init(card, json) {
        card.querySelector(".sub-title").innerHTML = json.subTitle;
        card.querySelector(".li1").innerHTML = json.li1;
        card.querySelector(".li2").innerHTML = json.li2;
        card.querySelector(".li3").innerHTML = json.li3;
    }
}
CARD_TYPES.youtube = {
    init(card, json) {
        card.querySelector(".youtube").src = json.youtube;
  
    }
}
CARD_TYPES.pics = {
    init(card, json) {
        card.querySelector(".pic1").src = json.pic1;
        card.querySelector(".pic2").src = json.pic2;
        card.querySelector(".pic3").src = json.pic3;
    }
}
CARD_TYPES.twoPicsAndText = {
    init(card, json) {
        card.querySelector(".content").innerHTML = json.content;
        card.querySelector(".pic1").src = json.pic1;
        card.querySelector(".pic2").src = json.pic2;
    }
}
