/************************     הוראות חשובות      ***********************/

/**
 
 1.   במידה וזאת פעם ראשונה שלכם ממלאים תוכן בלומדה, קראו את **קובץ הוורד** המצורף בתקייה
 2.   בעמוד זה יש למלא את הפרטים לגבי כל המידע והתוכן המבוקש
 3.   [amountOfQuestions במשתנה] לשים לב שבכל נושא צריך לכתוב את *כמות השאלות המקסימלית* שתלקח ממנו
      **משתנה זה מתייחס רק לשאלות שיילקחו בשביל **המבחן
 */


/************************      הכנס כותרת ראשית שהיא שם הלומדה      ***********************/
const TITLE = "לומדת כרטיסיות";

/****     הכנס כמות כוללת מקסימלית של שאלות למבחן. יש לשים לב לכמות השאלות הקיימות מהבהד - שלא כמות שלא קיימת   *******/
// const AMOUNT_EXAM_QUESTIONS = 10;

/************************      הכנס כמות זמן התחלתית של המבחן      ***********************/
const TIME_FOR_EXAM = "10:00";

const DATA = { 
    // // דוגמה לנושא
    // "נושא 1": {
    //     "icon":  "../assets/images/learning/Artboard 4.svg",
    //     // שאלות לנושא הזה
    //     "questionsExam": [
    //         {
    //             type: "multiple",
    //             question: "דוגמה לשאלה אמריקאית מתרגלת שיש לה 4 תשובות?",
    //             ans1: "תשובה ראשונה ולא נכונה",
    //             ans2: "תשובה שנייה נכונה!",
    //             ans3: "תשובה שלישית ולא נכונה",
    //             ans4: "תשובה רביעית לא נכונה",
    //             correctAns: "ans2"
    //         },
    //         {
    //             type: "binary",
    //             sentence: "דוגמה לשאלה מתרגלת נכונה של נכון או לא נכון",
    //             trueOrFalse: true
    //         }
    //     ],
    //     "questionsPractice": [
    //         {
    //             type: "multiple",
    //             question: "דוגמה לשאלה אמריקאית בוחנת שיש לה 4 תשובות?",
    //             ans1: "תשובה ראשונה ולא נכונה",
    //             ans2: "תשובה שנייה נכונה!",
    //             ans3: "תשובה שלישית ולא נכונה",
    //             ans4: "תשובה רביעית לא נכונה",
    //             correctAns: "ans2"
    //         },
    //         {
    //             type: "binary",
    //             sentence: "דוגמה לשאלה בוחנת נכונה של נכון או לא נכון",
    //             trueOrFalse: true
    //         }
    //     ],
    //     "amountOfQuestions": 2,
    //     "lessons": {
    //         "שיעור 1": {
    //             "learningContent": {
    //                 "נושא למידה 1": {
    //                     "כרטיסייה ראשונה מסוג טקסט": [ 
    //                         {
    //                             cardType: "text",
    //                             content: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים."
    //                         },
    //                         {
    //                             cardType: "textTwoParagraphs",
    //                             text1: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים.",
    //                             text2: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים. זוהי הפסקה השנייה של התוכן."
    //                         },
    //                         {
    //                             cardType: "textThreeParagraphs",
    //                             text1: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים.",
    //                             text2: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים. זוהי הפסקה השנייה של התוכן.",
    //                             text3: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים. זוהי הפסקה השלישית של התוכן."
    //                         }
    //                     ],
    //                     "כרטיסייה שנייה": [
    //                         {
    //                             cardType: "twoPics",
    //                             pic1: "../assets/images/pic.png",
    //                             content1: "דוגמה לכותרת לתמונה הראשונה",
    //                             pic2: "../assets/images/pic.png",
    //                             content2: "דוגמה לכותרת לתמונה השנייה"
    //                         },
    //                         {
    //                             cardType: "picAndText",
    //                             pic: "../assets/images/pic.png",
    //                             content: "דוגמה לכותרת לתמונה הראשונה",
    //                         }
    //                     ],
    //                     'כרטיסייה עם הרבה תוכן וגלילה': [
    //                         {
    //                             cardType: "pic_4titles_4text",
    //                             pic: "../assets/images/pic.png",
    //                             subTitle1: "כותרת ראשונה",
    //                             content1: "תשובה לכותרת הראשונה במשפט.",
    //                             subTitle2: "כותרת שנייה",
    //                             content2: "תוכן המפרט על הכותרת השנייה.",
    //                             subTitle3: "כותרת שלישית",
    //                             content3: "תוכן תוכן תוכן תוכן.",
    //                             subTitle4: "כותרת רביעית ואחרונה לכרטיסייה",
    //                             content4: "תשובה אחרונה לכותרת הרביעית. ניתן להוסיף עוד משפטים כמובן.",
    //                         },
    //                         {
    //                             cardType: "_3titles_3text",
    //                             subTitle1: "אפשרות לכותרות ותוכן בלי תמונות",
    //                             content1: "ולכל כותרת יש תוכן כמובן",
    //                             subTitle2: "כותרת שנייה",
    //                             content2: "תשובה לכותרת השנייה",
    //                             subTitle3: "כותרת שלישית ואחרונה",
    //                             content3: "תוכן אחרון לתת נושא זה. מוזמנים לעבור לתת נושא הבא!",
    //                         },
        
    //                     ],
        
    //                 },
    //                 "נושא למידה 2": {
    //                     "כרטיסייה שלישית מסוג וידאו": [
    //                         {
    //                             cardType: "video",
    //                             video: "../assets/images/פתיח.mp4"
    //                         },
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     "כרטיסייה רביעית": [
    //                         {
    //                             cardType: "text",
    //                             content: "מלא מילים של נושא ספיציפי, שנראה לי שייצא יפה אבל בואו נגלה יחדיו!"
    //                         }
    //                     ]
    //                 },
    //                 "נושא למידה 3": {
    //                     "תת תת נושא 12": [
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     "תת תת נושא 23": [
    //                         {
    //                             cardType: "list3",
    //                             subTitle: "כותרת לרשימה:",
    //                             li1:"משפט ראשון ברשימה, זה לדוגמה משט יחסית ארוך משאר המשפטים ויש נקודה בסוף המשפט.",
    //                             li2:"משפט שני ברשימה",
    //                             li3:"משפט שלישי ברשימה",
    //                         }
    //                     ]
    //                 },
    //                 "נושא למידה 4": {
    //                     "תת תת נושא 12": [
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     // "תת תת נושא 23": [
    //                     //     {
    //                     //         cardType: "twoPics",
    //                     //         pic1: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         // subTitle1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         pic2: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //         // subTitle2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //     }
    //                     // ]
    //                 },
    //                 "נושא למידה 5": {
    //                     "תת תת נושא 12": [
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     // "תת תת נושא 23": [
    //                     //     {
    //                     //         cardType: "twoPics",
    //                     //         pic1: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         // subTitle1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         pic2: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //         // subTitle2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //     }
    //                     // ]
    //                 }
    //             },
    //         },
    //         "שיעור 2": {
    //             "learningContent": {
    //                 "נושא למידה 1": {
    //                     "כרטיסייה ראשונה מסוג טקסט": [ 
    //                         {
    //                             cardType: "text",
    //                             content: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים."
    //                         },
    //                         {
    //                             cardType: "textTwoParagraphs",
    //                             text1: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים.",
    //                             text2: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים. זוהי הפסקה השנייה של התוכן."
    //                         },
    //                         {
    //                             cardType: "textThreeParagraphs",
    //                             text1: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים.",
    //                             text2: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים. זוהי הפסקה השנייה של התוכן.",
    //                             text3: "דוגמה לתוכן של כרטיסייה המחולקת לפי נושאים ותתי נושאים. זוהי הפסקה השלישית של התוכן."
    //                         }
    //                     ],
    //                     "כרטיסייה שנייה": [
    //                         {
    //                             cardType: "twoPics",
    //                             pic1: "../assets/images/pic.png",
    //                             content1: "דוגמה לכותרת לתמונה הראשונה",
    //                             pic2: "../assets/images/pic.png",
    //                             content2: "דוגמה לכותרת לתמונה השנייה"
    //                         },
    //                         {
    //                             cardType: "picAndText",
    //                             pic: "../assets/images/pic.png",
    //                             content: "דוגמה לכותרת לתמונה הראשונה",
    //                         }
    //                     ],
    //                     'כרטיסייה עם הרבה תוכן וגלילה': [
    //                         {
    //                             cardType: "pic_4titles_4text",
    //                             pic: "../assets/images/pic.png",
    //                             subTitle1: "כותרת ראשונה",
    //                             content1: "תשובה לכותרת הראשונה במשפט.",
    //                             subTitle2: "כותרת שנייה",
    //                             content2: "תוכן המפרט על הכותרת השנייה.",
    //                             subTitle3: "כותרת שלישית",
    //                             content3: "תוכן תוכן תוכן תוכן.",
    //                             subTitle4: "כותרת רביעית ואחרונה לכרטיסייה",
    //                             content4: "תשובה אחרונה לכותרת הרביעית. ניתן להוסיף עוד משפטים כמובן.",
    //                         },
    //                         {
    //                             cardType: "_3titles_3text",
    //                             subTitle1: "אפשרות לכותרות ותוכן בלי תמונות",
    //                             content1: "ולכל כותרת יש תוכן כמובן",
    //                             subTitle2: "כותרת שנייה",
    //                             content2: "תשובה לכותרת השנייה",
    //                             subTitle3: "כותרת שלישית ואחרונה",
    //                             content3: "תוכן אחרון לתת נושא זה. מוזמנים לעבור לתת נושא הבא!",
    //                         },
        
    //                     ],
        
    //                 },
    //                 "נושא למידה 2": {
    //                     "כרטיסייה שלישית מסוג וידאו": [
    //                         {
    //                             cardType: "video",
    //                             video: "../assets/images/פתיח.mp4"
    //                         },
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     "כרטיסייה רביעית": [
    //                         {
    //                             cardType: "text",
    //                             content: "מלא מילים של נושא ספיציפי, שנראה לי שייצא יפה אבל בואו נגלה יחדיו!"
    //                         }
    //                     ]
    //                 },
    //                 "נושא למידה 3": {
    //                     "תת תת נושא 12": [
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     "תת תת נושא 23": [
    //                         {
    //                             cardType: "list3",
    //                             subTitle: "כותרת לרשימה:",
    //                             li1:"משפט ראשון ברשימה, זה לדוגמה משט יחסית ארוך משאר המשפטים ויש נקודה בסוף המשפט.",
    //                             li2:"משפט שני ברשימה",
    //                             li3:"משפט שלישי ברשימה",
    //                         }
    //                     ]
    //                 },
    //                 "נושא למידה 4": {
    //                     "תת תת נושא 12": [
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     // "תת תת נושא 23": [
    //                     //     {
    //                     //         cardType: "twoPics",
    //                     //         pic1: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         // subTitle1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         pic2: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //         // subTitle2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //     }
    //                     // ]
    //                 },
    //                 "נושא למידה 5": {
    //                     "תת תת נושא 12": [
    //                         {
    //                             cardType: "videoAndText",
    //                             video: "../assets/images/פתיח.mp4",
    //                             content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
    //                         }
    //                     ],
    //                     // "תת תת נושא 23": [
    //                     //     {
    //                     //         cardType: "twoPics",
    //                     //         pic1: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         // subTitle1: "זה דוגמה לתמונה מוצלחת ראשונה",
    //                     //         pic2: "../assets/images/Artboard 1 copy 2@2x.png",
    //                     //         content2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //         // subTitle2: "זה דוגמה לתמונה מוצלחת שנייה"
    //                     //     }
    //                     // ]
    //                 }
    //             },
    //         },
    //     },
    // },

    "חוק ותמרורים": {
        "icon": "",
        "questions": [
            {
                type: "multiple",
                img: `../assets/images/image_example.jpg`,
                question: `11111 road`,
                ans1: `c`,
                ans2: `c`,
                ans3: `c`,
                ans4: `c`,
                correctAns: "ans1"
            },
            {
                type: "multiple",
                img: `../assets/images/imageee.jpg`,
                question: `2222 bird`,
                ans1: ``,
                ans2: ``,
                ans3: ``,
                ans4: ``,
                correctAns: "ans2"
            },
            {
                type: "multiple",
                img: `../assets/images/imageee.jpg`,
                question: `4444444 also a bird`,
                ans1: ``,
                ans2: ``,
                ans3: ``,
                ans4: ``,
                correctAns: "ans2"
            },
            // {
            //     type: "binary",
            //     sentence: `333`,
            //     trueOrFalse: true
            // }
        ],
        "amountOfQuestions": 3,
        lessons: {
            //תמרורים
            "תמרורים": {
                learningContent: {
                    
                }
            },


            //מצגת 1
            "הגדרת מושגים": {
                "learningContent": {
                    "הקדמה": {
                        "הקדמה": [ 
                            {
                                cardType: `text`,
                                content: `בפרק זה נגדיר מספר מונחים אותם עליך להכיר.
                                מטרתן של ההגדרות היא לתת תיאור מדויק ככל האפשר של מונחים מתחום התעבורה, כפי שהמחוקק התכוון אליהם. <br><br>
                                לעיתים יש הבדל בין ההגדרה "העממית" השגורה בפי כל, לבין ההגדרה "החוקית", כלומר ההגדרות שבפקודת התעבורה או בתקנות ומכאן חשיבותו של פרק זה. 
                                כך למשל, לא תהיה תמיד הגדרת "דרך" בתקנות, זהה למונח, כפי שהוא מוכר לך מחיי היומיום.`
                            }
                        ],
                    },
                    "כלי רכב": {
                        "כלי רכב הנעים בכביש" : [
                            {
                                cardType: `textTwoParagraphs`,
                                text1: `"<b>רכב</b>" – רכב הנע בכוח מכני או הנגרר על ידי רכב כזה או על ידי בהמה, וכן מכונה או מתקן, הנעים או הנגררים כאמור, כולל אופניים ותלת-אופן, ולמעט רכב ששר התחבורה פטר אותו בצו מהוראות פקודה זו כולן או מקצתן.`,
                                text2: `"<b>רכב נוסעים פרטי</b>" – רכב מנועי פרטי המיועד להסיע נוסעים אשר צוין ברישיון הרכב שלו סיווג אישי 1.M
                                שים לב – <b>רשות הרישוי</b> היא המגדירה את <b>סוג הרכב</b> ולא יצרן הרכב. כך למשל, ניתן לראות רכב המוגדר ברישיונו כ"רכב נוסעים פרטי", לצד אותו רכב בדיוק, שיוגדר ברישיונו כ"מונית". 
                                רשות הרישוי תגדיר לרוב רכב כ"רכב נוסעים פרטי", אם הוא מיועד להסיע על פי מבנהו עד 8 נוסעים, כולל על הנהג.`
                            },
                            {
                                cardType: `text`,
                                content: `"<b>כלי רכב מסחריים</b>" - יוגדרו על פי רוב באמצעות תיאור מפורט יחסית של מבנה הרכב. 
                                כך למשל יאופיין "טנדר" בכך שתתקיים הפרדה בין תא הנהג לבין תא המטען והוא ייקרא "רכב מסחרי בלתי אחוד", להבדיל מה-VAN  שיוגדר כ"רכב מסחרי אחוד".`,
                            },
                        ],
                    },
                    "כבישים ודרכים": {
                        "כביש" : [
                            {
                                cardType: `textTwoParagraphs`,
                                text1: `"<b>רכב</b>" – רכב הנע בכוח מכני או הנגרר על ידי רכב כזה או על ידי בהמה, וכן מכונה או מתקן, הנעים או הנגררים כאמור, כולל אופניים ותלת-אופן, ולמעט רכב ששר התחבורה פטר אותו בצו מהוראות פקודה זו כולן או מקצתן.`,
                                text2: `"<b>רכב נוסעים פרטי</b>" – רכב מנועי פרטי המיועד להסיע נוסעים אשר צוין ברישיון הרכב שלו סיווג אישי 1.M
                                שים לב – <b>רשות הרישוי</b> היא המגדירה את <b>סוג הרכב</b> ולא יצרן הרכב. כך למשל, ניתן לראות רכב המוגדר ברישיונו כ"רכב נוסעים פרטי", לצד אותו רכב בדיוק, שיוגדר ברישיונו כ"מונית". 
                                רשות הרישוי תגדיר לרוב רכב כ"רכב נוסעים פרטי", אם הוא מיועד להסיע על פי מבנהו עד 8 נוסעים, כולל על הנהג.`
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road1.png`,
                                content: `חלק הדרך המיועד לתנועת כלי הרכב, שנסלל או שופר לשם כך, או שתנועת כלי רכב נוהגת לעבור בו, למעט שולי דרך.
                                כלומר, כביש אינו בהכרח סלול אספלט.
                                די בכך <b>שתנועת כלי רכב נוהגת לעבור בו</b> על מנת שייחשב "כביש". על פי התקנות.
                                אין לנהוג בכביש ברכב המשמיע רעש בלתי סביר ורועש במיוחד.`},
                        ],
                        "כביש חד סטרי" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road2.png`,
                                content: `כל כביש שתנועת כלי רכב מותרת בו בכיוון אחד בלבד.
                                תנועה <b>בניגוד</b> לכיוון בדרך חד סטרית מותרת רק על פי <b> הוראת שוטר </b>, או <b> לרכב ביטחון בתפקיד</b>.`
                            },
                        ],
                        "שולי הכביש" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road3.png`,
                                content: `השטח שאין לצידו מדרכה <b>הסמוך לשפת הכביש</b>, עד לרוחב של שלושה מטרים או עד לקצה תעלת ניקוז, כאשר דופן התעלה מצוי פחות משלושה מטרים משפת הכביש. <br>
                                שול הכביש, יכול שהיה סלול, או לא, לעיתים יש הפרש גבהים בינו לבין הכביש, אולם הוא תחום בין שפת הכביש לבין תעלת הניקוז. אם המרחק בינה לבין שפת הכביש עולה על 4 מטר, אזי רק ארבעת המטרים הצמודים לשפת הכביש ייחשבו כ"שול" ( "שול – יחיד, שוליים" – רבים).`
                            },
                        ],
                        "שביל" : [
                            {
                                cardType: `picAndText`,
                                // חסרה תמונה
                                pic: `../assets/images/pics/road4.png`,
                                content: `דרך או חלק מדרך <b>שאינו כביש</b> שהוקצה לסוג עוברי דרך. <br>
                                כך למשל שביל להולכי רגל, או שביל לאופניים בלבד.`
                            },
                        ],
                        "נתיב" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road5.png`,
                                content: `חלק מרוחבו של כביש, בין שסומן ובין שלא סומן, המספיק לתנועת טור אחד של כלי רכב, למעט רכב הנע של שני גלגלים. <br>
                                כלומר, נתיב אינו מוגדר במטרים ואינו חייב להיות מסומן. <br> 
                                די בכך שיש מקום לתנועת טור אחד של כלי רכב ארבעה גלגליים, על מנת שיוגדר כנתיב. <br>
                                כמובן שאם קיים סימון בכביש, הרי הנתיב תחום ע"י הסימון.`
                            },
                        ],
                        "מעבר חצייה" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road6.png`,
                                content: `חלק מהכביש המסומן כמיועד לחצייתו על ידי הולכי רגל.`
                            },
                        ],
                        "שטח הפרדה" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road7.png`,
                                content: `כל מבנה, אי תנועה, סימון שטח על פני הדרך, גינה, שטח לא סלול וכיוצא באלה, <b>המחלקים את הדרך לאורכה</b>. <br>
                                שטח הפרדה כשלעצמו, יכול שיקבע באמצעות סימון בלבד ואינו חייב להיות בנוי אבן.`
                            },
                        ],
                        "שטח הפרדה בנוי" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road8.png`,
                                content: `שטח הפרדה המחלק את הדרך לאורכה באמצעות <b>התקן מוגבה מעל הכביש</b> כגון אבן מוגבהת, מעקה בטיחות או צמחיה. <br>
                                זהו שטח הפרדה המוכר לנו בשמו העממי "אי תנועה".<br>
                                שטח הפרדה, מחלק כביש דו סטרי, לשני כבישים חד סטריים. <br>
                                <b>תפקידו ליצור הפרדה בין כיווני תנועה מנוגדים</b>.<br>
                                <b>אסור</b> לחנות או לעצור בו ויש לנהוג תמיד מציידו הימני, אלא אם תמרור מורה אחרת.`
                            },
                        ],
                        "צומת" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road9.png`,
                                content: `הגדרת הצומת מחריגה שורת מפגשים של כבישים עם משטחים סלולים אחרים, דוגמת התמזגויות, כניסה לחצרות ולתחנות דלק ועוד. <br>
                                הסיבה לכך – תקנות רבות, עליהן נדון בהמשך, מטילות על הנהג חובות רבות בעת התקרבו לצומת ובעוברו בו. <br>כל אלה לא יחולו באותם האזורים שלא יוגדרו כ"צומת", ומכאן חשיבותה של ההגדרה.`
                            },
                        ],
                        "מחלף" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road10.png`,
                                content: `<b>מפגש של שני כבישים שלא באותו מפלס.</b> <br>
                                כלומר מפגש דרכים במפלסים שונים הכולל את הדרכים המחברות בין המפגש.`
                            },
                        ],
                        "מפגש מסילת רכבת" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road11.png`,
                                content: `מקום <b>שדרך ומסילת ברזל חוצים זו את זו במפלס אחד </b> והוא מסומן בתמרור שנקבע לכך.` },
                        ],
                        "קו עצירה" : [
                            {
                                cardType: `picAndText`,
                                // חסרה תמונה 
                                pic: `../assets/images/pics/road12.png`,
                                content: `קו לרוחב הכביש או בחלק מרוחבו, <b>המסמן גבול לשם עצירת רכב</b> סמוך לרמזור או לתמרור עצירה או לפני מפגש מסילת ברזל, או במקום שבו שוטר מכוון את התנועה.<br>
                                כלומר קו עצירה כשלעצמו, אינו מחייב עצירה. הוא מסמן לנהג היכן עליו לעצור, אם הוא נדרש לעשות כן, על פי <b> הוראה חוקית כלשהי </b> (כגון רמזור, תמרור וכו'). <br>
                                תמרור ייחשב "חוקי" ותקף אם הוצב כחוק, כלומר הצבתו אושרה על ידי רשות תמרור מרכזית , או רשות תמרור מקומית.`
                            },
                        ],
                        "אזור מיתון תנועה" : [
                            {
                                cardType: `picAndText`,
                                // חסרה תמונה 
                                pic: `../assets/images/pics/road13.png`,
                                content: `אזור שבו המהירות המרבית המותרת <b> אינה </b> עולה על <b> 30 קמ"ש </b> והוא מסומן בתמרור 222 בכניסה ואליו ו – 223 ביציאה ממנו.`
                            },
                        ],
                        "רחוב משולב" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road14.png`,
                                content: `דרך המיועדת <b>למשחקי ילדים, להולכי רגל ולרכב </b>ואשר בכניסה אליה הוצב תמרור המורה על רחוב משולב. <br>
                                עקרונית, רצוי להימנע ככל האפשר מנהיגה ברחוב כזה. אולם אם לא ניתן להימנע מנהיגה בו, יש לנהוג באופן <b>שלא יגרם סיכון לעוברי הדרך בה ולא תופרע פעילותם</b> של עוברי הדרך והילדים המשחקים במקום. <br>
                                מהירות הנסיעה המרבית המותרת ברחוב משולב – <b>30 קמ"ש</b>.`
                            },
                        ],
                    },
                    "רכבים": {
                        "רכב מיושן" : [
                            {
                                cardType: `picAndText`,
                                // חסרה תמונה
                                pic: `../assets/images/pics/road15.png`,
                                content: `רכב ישן, נקרא בלשון המחוקק "רכב מיושן", אולם לא כל רכב שהיה מכונה כך בלשון העם, יוגדר כזה על ידי המחוקק:
                                <br>
                                "<b>רכב מיושן</b>" –
                                <ol>
                                <b><li>רכב</b>, למעט טרקטור, גרור או אוטובוס, שבמועד חידוש רישיונו, <b>מלאו 19 שנים</b> משנת ייצורו. </li>
                                <li> <b>אוטובוס</b> שממועד חידוש רישיונו <b>מלאו 15 שנים</b> משנת ייצורו.
                                </li>
                                </ol>`
                            },
                        ],
                        "רכב שטח" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road16.png`,
                                content: `רכב מנועי המיועד לפני מבנהו לנוע <b>בדרכי עפר בלבד</b>, ומתקיימים בו אלה:
                                <ul>
                                <li> נע על <b>4 גלגלים לפחות</b>.
                                <li> נפח מנועו אינו עולה על 750 סמ"ק.
                                <li> משקלו העצמי <b>אינו</b> עולה על 750 ק"ג.
                                <li> ההיגוי שבו נעשה באמצעות <b>הגה</b>.
                                <li> הוא <b>צוין ברישיון הרכב כרכב שטח</b>.
                                </ul>`
                            },
                        ],
                        "רכב בטחון" : [
                            {
                                cardType: `text`,
                                content: `<b>רכבי הבטחון הם:</b> <br>
                                אמבולנס של מגן דוד אדום, או אמבולנס שניתן לגביו אישור על היותו רכב בטחון מאת מנהל משרד הבריאות או מטעמו, אופנוע להגשת עזרה ראשונה רכב של משטרת ישראל או של צבא הגנה לישראל, רכב לכיבוי שריפות ורכב אחר שאושר על ידי רשות הרישוי כרכב בטחון, כשהם <b>מפיצים בפנס מיוחד אור </b>מהבהב אדום, כחול או אדום-כחול <b>ומשמיעים את האזעקה בסירנה </b>.`
                            },
                            {
                                cardType: `pics`,
                                pic1: `../assets/images/pics/car1.png`,
                                pic2: `../assets/images/pics/car2.png`,
                                pic3: `../assets/images/pics/car3.png`,
                            },
                        ],
                        "רכב תפעולי" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car8.png`,
                                content: `כלי רכב המשמשים על פי רוב לעבודה. רכב תפעולי אינו מוגדר כרכב פרטי, או ציבורי, חלות עליו מגבלות מיוחדות וככלל, הוא <b>רשאי לנוע רק באזורים מוגדרים</b> המכונים "איזור רכב תפעולי". <br>
                                כך למשל כלי רכב ייעודים הנעים בנמלי אוויר, נמלי ים וכו'.`
                            },
                        ],
                        "מכונה ניידת" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car4.png`,
                                content: `רכב מנועי שלפי מבנהו <b>מיועד לביצוע עבודות</b> ואינו מיועד לגרירה.`
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car5.png`,
                                content: `"מלגזה" – מכונה ניידת בעלת תורן או זרוע שליפה, שלהם מחובר מזלג או התקן אחר המיועדים להרמה ולשינוע של משאות, אשר צוינה ברישיונה כמלגזה.`
                            },
                        ],
                        "טרקטור" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car6.png`,
                                content: `רכב מנועי המיועד לפי מבנהו <b>לגרירה</b> או <b>לגרירה ולביצוע עבודות</b>, שצוין ברישיון הרכב כטרקטור. `
                            },
                            {
                                cardType: `text`,
                                content: `"<b>טרקטור משא</b>" – טרקטור שנתקיימו בו כל אלו:
                                <ul>
                                <li>נע על <b>4 גלגלים לפחות</b>. </li>
                                <li>משקלו הכולל המותר <b>לא עולה על 1,500 ק"ג</b>. </li>
                                <li> ההיגוי שבו נעשה באמצעות <b>ההגה</b>. </li>
                                <li> מצויד <b>בדיפרנציאל</b> </li>
                                <li> <b>בעל משטח הטענה</b> שהרכיב היצרן בתהליך ייצורו, המיועד לגרירה ולהובלת טובין. </li>
                                <li>צוין ברישיון הרכב כטרקטור משא. </li>
                                </ul>`
                            },
                        ],
                       "טרקטורון" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road16.png`,
                                content: `טרקטורון הוא טרקטור <b>שנתקיימו בו כל אלה</b>:
                                <ul>
                                <li>הוא נע על <b> 4 גלגלים לפחות</b>.</li>
                                <li>אופן הישיבה עליו הוא כשרגלי הנהג <b>משני צידי המושב</b>.</li>
                                <li>ההיגוי בו נעשה באמצעות<b> כידון</b>.</li>
                                <li>הוא <b>צוין ברישיון</b> הרכב כטרקטורון. </li>
                                </ul>`
                            },
                        ],
                        "רכב איטי" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car8.png`,
                                content: `רכב מנועי שלגביו נקבעה מהירות מקסימלית שאינה עולה על<b> 40 קמ"ש </b>על ידי רשות הרישוי ברישיונו של הרכב או בתקנות אלה.`
                            },
                        ],
                        "משקל כולל מותר" : [
                            {
                                cardType: `twoPicsAndText`,
                                pic1: `../assets/images/pics/car10.png`,
                                pic2: `../assets/images/pics/car11.jpg`,
                                content: `המשקל העצמי בתוספת משקל האנשים והמטען <b>שהתירה רשות רישוי לרכב הנדון</b> להסיע או להוביל. <br>
                                "<b>משקל עצמי</b>" – משקל הרכב ללא מטען וללא נהג, לרבות משקל כל אבזרי הרכב ומשקל הדלק, המים והשמן שבו. `
                            },
                        ],
                        "מושב בטיחות" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/chair.png`,
                                content: `מושב הרתום לרכב באמצעות חגורת בטיחות <b>המיועד להסעת ילדים </b> ברכב, שמותקנות בו חגורות המיועדות לרתימת הילד אליו, העומד בתקן. <br>
                                על מנת לפשט – מושב הבטיחות עצמו – לא הילד היושב עליו – <b>מעוגן למושב הרכב הרגיל </b>, באמצעות חגורות הבטיחות הרגילות שברכב. בנוסף, מותקנות במושב הבטיחות חגורות, המיועדות <b> לרתום אליו את הילד </b> המוסע בו.`
                            },
                        ],
                        "מושב מגביה" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/chair2.png`,
                                content: `מושב המיועד להסעת ילדים <b>בגילאי 3 עד 8</b> ברכב כשהילד היושב אליו רתום בחגורת הבטיחות של הרכב והעומד בתקן. <br>
                                בניגוד ל"מושב הבטיחות", אין במושב זה חגורות מיוחדות – זהו מושב המיועד להסעת ילדים גדולים יותר, המאפשר לחגור ילדים אלה בחגורות הבטיחות הרגילות של הרכב, באמצעות הגבהת המושב המקורי שברכב.`
                            },
                        ],
                    },
                    "השפעות חיצוניות": {
                        "זמן תאורה" : [
                            {
                                cardType: `text`,
                                content: `זמן הלילה וכן זמן אחר שבו הראות לקויה מחמת תנאי מזג האוויר, או מחמת סיבות אחרות.
                                זהו הזמן שבו נדרש הנוהג <b>להדליק אורות ברכב</b>.<br> 
                                הנהג נדרש להדליק את אורות הרכב, לא רק בלילה, אלא לעיתים גם בשעת הצהריים, למשל עקב קיומם של תנאי ראות לקויים. כך למשל <b> מחייבות התקנות הדלקת אורות בחורף, בין 1 נובמבר ועד 31 במרץ</b> בכל שנה.`
                            },
                        ],
                        "לילה" : [
                            {
                                cardType: `text`,
                                content: `פרק הזמן שבין תום רבע שבע <b>לאחר שקיעת השמש</b> לבין תחילת רבע שעה לפני זריחתה. <br>
                                הסבר פשוט – גם לאחר ששקע גלגל השמש, קיימת תאורה מספקת ואין עדיין צורך בהדלקת אורות. רק רבע שעה מאוחר יותר, נעשה חשוך ואז מתחיל ה"לילה" במובנו התחבורתי. <br>כך גם בבוקר – גם לאחר שעלה גלגל השמש, עדיין חשוך וה"לילה" התחבורתי נמשך ואסור עדיין לנהוג ללא אורות. רק רבע שעה מאוחר יותר, משעולה השחר והתאורה הופכת לחזקה יותר, ניתן לכבות את האורות. `
                            },
                        ],
                        "עמעום" : [
                            {
                                cardType: `text`,
                                content: `כיבוי אור הדרך בפנסי החזית, והדלקת אור המעבר, כשמשמעותם בתקנה. <br>
                                עקרונית מצויד הרכב בשלושה סוגי אורות:
                                <ul>
                                <li>אור חניה, המיועד לחניה בלבד ולא לנסיעה. 
                                <span><img class="sml-pic" src="../assets/images/pics/light1.png"/></span>
                                </li>

                                <li> אור נמוך. 
                                <span><img class="sml-pic" src="../assets/images/pics/light2.png"/></span>
                                </li>

                                <li> אור דרך ("האור הגבוה"). 
                                <span><img class="sml-pic" src="../assets/images/pics/light3.png"/></span>
                                </li>
                                </ul>

                                <b>ה"עמעום" מחליף את אור הדרך באור נמוך.</b>`
                            },
                        ],
                        "עוברי הדרך" : [
                            {
                                cardType: `text`,
                                content: `לא רק לנהגים לעשות שימוש בדרך, אלא גם להולכי רגל, לרוכבי אופניים, נוהגי בעלי חיים וכו'. כל הנ"ל מכונים בשם הכללי "עוברי דרך" והם מוגדרים באופן הבא: <br>
                                <b>"עובר דרך</b>" – המשתמש בדרך לנסיעה, להליכה, לעמידה, או לכל מטרה אחרת.`
                            },
                        ],
                        "מתן זכות קדימה" : [
                            {
                                cardType: `text`,
                                content: `אי-המשכת הנסיעה או התחלתה כאשר על ידי כך הנהג ברכב הנדרש לתת זכות קדימה לנוהגים ברכב אחר לאלצם לסטות מקו נסיעתם או לשנות את מהירות נסיעתם.`
                            },
                        ]
                    }
                },
            },
            // מצגת 2
            "רישיונות והיתרים": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `text`,
                                content: `בפרק זה נסקור מספר הנחיות כלליות הנוגעות לשימוש ברכב ואשר חלות על בעליו של הרכב, על מי השליטה ברכב נמצאת בידו וכמובן על נהג הרכב. <br>
                                כמו כן נסקור את סמכויותיה של רשות הרישיוי, בכל הנוגע ליחסים שבינה לבין בעלי רישיונות נהיגה ובעלי רכב. `
                            },
                        ],
                    },
                    "רשות הרישוי": {
                        "רשות הרישוי" : [
                            {
                                cardType: `text`,
                                content: `הגוף היחידי הרשאי להנפיק רישיון נהיגה ורישיון רכב הוא <b>רשות הרישוי</b>, והיחיד שיכול לשנות אותם. <br>
                                הנהג עצמו אינו רשאי לבצע שום שינוי ברישיון הנהיגה או רישיון הרכב. <br>
                                רשות הרישוי היא גם היחידה הרשאית להנפיק " <b> רישיון סחר </b> " וזאת לצורך בדיקת רכב לקראת קנייתו. <br>
                                במקרים של שינוי מסוים במצב בריאותו של הנהג (מחלת לב, מגבלות במערכת העצבים, העצמות, הראיה והשמיעה), חייב הנהג להודיע על השינוי לרשות הרישוי בתוך 15 ימים מהרגע שקרה.
                                `
                            },
                            {
                                cardType: `text`,
                                content: `<b>לרשות הרישוי סמכויות נוספות כגון:</b>
                                <ol>
                                <li>קבלת דיווחים בדבר עבירות שביצעו נהגים. <b>חשוב לזכור</b> – כל נהג רשאי לדווח לרשות הרישוי על עבירות שביצע נהג אחר, אולם רשות הרישוי תקל דיווח כזה, רק אם מדובר בסוג מסוים של עבירות ובתנאי שהנהג המתלונן נכח בעצמו בעת ביצוע העבירה. </li>
                                <li>מתן אישור להסעת נוסעים בשכר ברכב פרטי (באמצעות "הוראת שעה").</li>
                                <li>להזמין נהג לבירור ולהוסיף תנאים ברישיון הנהיגה שלו.</li>
                                <li>לזמן נהגים לעבור השתלמות או הדרכה בנהיגה.</li>
                                </ol>`
                            },
                            {
                                cardType: `text`,
                                content: `<ol start="5">
                                <li>לזמן רכב לביצוע<b> בדיקה טכני </b>. סמכות זו נתונה גם לבוחן של <b>משטרת ישראל</b>. בוחנים אלה, רשאים גם למסור לנהג "הודעת אי שימוש" ברכב, אם הם מוצאים בבדיקה, כי הרכב מסכן את התנועה.</li>
                                <li>לאשר העברת בעלות ברכב, כשהיא נוכחת ששולם כל מס ואגרה וכן כי הרכב אינו מעוקל או משועבד. <b>יש לזכור</b> - החובה לדאוג להעברת הבעלות על רכב בעת מכירתו, חלה על <b>בעל הרכב</b> (לא על הקונה ולא על רשות הרישוי, שרק מאשרת את העברת הבעלות, אך אינה יוזמת אותה). </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `<ol start="7">
                                <li> לאשר לנהג <b>להקפיא</b> את רישיון הרכב – אם מספיק בעל הרכב לעשות שימוש ברכבו למשך תקופה העולה על חודש ימים, עליו להודיע על כך לרשות הרישוי.
                                </li>
                                </ol>
                                `
                            },
                        ],
                    },
                    "רישוי נהגים": {
                        "מי יכול להוציא רישיון נהיגה?" : [
                            {
                                cardType: `text`,
                                content: `עקרונית, זכותו של כל אדם לקבל רישיון נהיגה לרכב. <br>
                                יוצאים מן הכלל הם אנשים שהתגלו אצלם ליקויי בריאות כשמתגלים ליקויים בריאותיים אצל בעלי רישיון נהיגה, מוסמכת רשות הרישוי לפסול את רישיונם של אנשים אלה.
                                `
                            },
                        ],
                        "גיל מינימלי לקבלת רישיון" : [
                            {
                                cardType: `text`,
                                content: `
                                הגיל המינימלי לקבלת רישיון נהיגה, משתנה בהתאם <b>לסוג הרכב</b> בו מדובר:
                                <ul>
                                <li>על מנת לנהוג <b>בטרקטורון</b>, <b>טרקטור ומכונה ניידת</b>, יש צורך בקבלת רישיון נהיגה דרגה 1, שהגיל המינימלי לקבלתו הוא <b>16</b>.
                                </li>
                                <li>על מנת לנהוג ברכב נוסעים <b>פרטי</b> וברכב <b>מסחרי</b> שמשקלו הכולל המותר לא עולה על 3,500 ק"ג, יש צורך ברישיון נהיגה מדרגה B, שהגיל המינימלי לקבלתו הוא <b>16 ו-9 חודשים</b>. בעל רישיון נהיגה מדרגה B רשאי גם לגרור גרור, שמשקלו עד 1,500 ק"ג.
                                </li>
                                <li>על מנת לנהוג ברכב <b>ביטחון</b>, או רכב <b>חילוץ</b>, יש צורך <b>בהיתר מיוחד</b>, הניתן ע"י רשות הרישוי.
                                </li>
                                </ul>
                                `
                            },
                        ],
                    },
                    "רישיון נהיגה ומסמכים": {
                        "נהיגה ברכב" : [
                            {
                                cardType: `text`,
                                content: `אדם רשאי לנהוג ברכב, רק אם יש לו <b>רישיון נהיגה תקף</b> לאותו סוג רכב ובהתאם למגבלות המצוינות ברישיון הנהיגה, (אם וככל שמצוינות כאלה). <br>
                                כך למשל, אם צוינה מגבלה המחייבת הרכבת משקפיים, או עדשות מגע בעת נהיגה, אין לנהוג בלעדיהן. <br>
                                יתירה מזאת, גם לבעל רכב, או למי שהשליטה ברכב בידיו, <b>אסור</b> לאפשר לאחר לנהוג, אם הוא יודע שאין בידי האחר רישיון נהיגה תקף לאותו סוג רכב.
                                `
                            },
                            {
                                cardType: `text`,
                                content: `הגדרת "נהיגה" - אדם הדוחף רכב ייחשב כמי שנוהג בו לכל עניין הקשור בחובת הציות לדיני התעבורה. כל למשל, אסור לאדם שאין לו רישיון נהיגה לאופנוע, להסיע אופנוע בכוח הגוף.`
                            },
                        ],
                        "מסמכים" : [
                            {
                                cardType: `text`,
                                content: `בעת הנהיגה חייב נהג להחזיק ברשותו <b>רישיון רכב תקף ותעודת ביטוח חובה תקפה ומשולמת</b>, כשהמסמכים במצב תקין, נקי וקריא. <br>
                                עקרונית, <b>אין</b> להסתפק בתצלום בלבד, אלא אם כן מדובר ברכב השייך לחברה, שבה קיים קצין בטיחות, המאשר בחתימתו ובחותמו את תפוקתם של המסמכים המצולמים.`
                            },
                            {
                                cardType: `text`,
                                content: `בעת הוצאת רישיון רכב, או בעת חידושו של רישיון כזה, נדרש הנהג להציג תעודת ביטוח תקפה, גם בפני רשות הרישוי (או מכון הרישוי, בו מבוצע המבחן השנתי ואשר משמש כנציגה של רשות הרישוי לעניין זה).
                                `
                            },
                        ],
                    },
                    "סמכויות שוטרים וקציני משטרה": {
                        "פסילה מנהלית" : [
                            {
                                cardType: `text`,
                                content: `
                                ישנם מקרים, בהם רשאי קצין משטרה <b>לפסול</b> מנהלית את רישיון הנהיגה:
                                <ol>
                                <li>לתקופה בת <b>30</b> יום – אם הנהג ביצע עבירה שיש בה <b>סיכון הולך רגל במעבר חציה</b>.
                                </li>
                                <li>לתקופה בת <b>60</b> יום – אם היה הנהג <b>מעורב בתאונה</b> בה נגרמה <b>חבלה לאדם או שנגרם נזק לרכוש</b>.
                                </li>
                                <li>לתקופה בת <b>90</b> יום – אם היה הנהג <b>מעורב בתאונות דרכים</b>, שבה נהרג אדם</b>.
                                </li>
                                </ol>
                                `
                            },
                        ],
                        "הודעת אי שימוש ברכב מסחרי" : [
                            {
                                cardType: `text`,
                                content: `כשמדובר ברכב מסחרי ושוטר מגלה בבדיקה כי מובל מטען שמשקלו עולה על המותר, רשאי השוטר למסור לנהג "<b>הודעת איסור שימוש</b>" ברכב ולקחת מהנהג את רישיון הנהיגה שלו, כל זאת למשך <b>30</b> יום. <br>
                                אם זו הודעה שניה בתוך תקופה של 3 שנים תארך תקופת האי שימוש 60 יום. <br>
                                זכור: נהג שייתפס נוהג בעת <b>שלילה</b>, עלול לשלם על כך עד <b>3 שנות מאסר בפועל</b>.
                                `
                            },
                        ],
                    },
                    "נהג חדש": {
                        "חובות הנהג חדש" : [
                            {
                                cardType: `text`,
                                content: `בשנתיים הראשונות לנהיגתו, נחשב נוהג רכב ל"נהג חדש". בתקופה זו (ובכל עת אחרת בה הוא מוגדר כ"נהג חדש"), חייב נהג להצמיד <b>תווית "נהג חדש"</b> לשוליו התחתונים של חלון הרכב האחורי, כך שתיראה ע"י הנוהג מאחוריו. <br>
                                בשלושת החודשים הראשונים לנהיגתו, חייב נהג חדש לנהוג <b>בליווי מלווה היושב במושב שלצד הנהג</b>, שבידו רישיון נהיגה לאותו סוג רכב בו הנהג החדש נוהג. 
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/sign1.png`,
                                content: `נוהג חדש, שגילו צעיר מ-21 אינו רשאי להסיע יותר מ-2 נוסעים (אלא אם נמצא ברכב מלווה).
                                `
                            },
                        ],
                        "מלווה לנהג חדש" : [
                            {
                                cardType: `text`,
                                content: `
                                המלווה, אם אינו מורה נהיגה, <b>חייב להיות אדם העונה על אחת מהאפשרויות הבאות</b>: 
                                <ol>
                                <li>בן 24 שנים ויש בידו רישיון נהיגה לאותו סוג רכב, 5 שנים לפחות.
                                </li>
                                <li>בן 30 שנים ויש בידו רישיון נהיגה לאותו סוג רכב, 3 שנים לפחות.
                                </li>
                                </ol>
                                `
                            },
                        ],
                    },
                    "הכניסה לרכב והנסיעה": {
                        "תקינות הרכב" : [
                            {
                                cardType: `text`,
                                content: `ככלל, אין לנהוג ברכב שאינו תקין, או ברכב ששדה הראיה שלו בו מוגבל. 
                                החריג לכך – אם ההגבלה קלה וזניחה. <br>
                                ברכב שלא ניתן לראות מבעד לשמשה האחורית שלו, יש להתקין מראות תשקיף מציידי הרכב.<br>
                                כשהרכב חונה בציידו הימני של הכביש ויש להתקדם על הכביש לקראתו, עדיף להתקרב אליו מלפנים, אל מול פני התנועה המתקרבת.
                                `
                            },
                        ],
                        "נסיעה חדשה" : [
                            {
                                cardType: `text`,
                                content: `
                                לפני תחילת כל נסיעה, על הנהג לוודא קיומם של אביזרים מסוימים ברכב:
                                <ol>
                                    <li><b>גלגל חלופי ומגבה</b> (חייבים להימצא בכל רכב הנע על גלגל גומי, למעט טרקטור, תומך ומכונה ניידת שמשקלה עולה על 400 ק"ג). 
                                    </li>
                                    <li><b>משולש אזהרה</b> (חייב להימצא בכל רכב מנועי למעט אופנוע) וכן בנתמך, <b>אפוד זוהר</b>.
                                    </li>
                                    <li><b>מטף לכיבוי אש</b> (חייב להימצא בכל רכב מנועי, למעט רכב נוסעים פרטי, טרקטור ואופנוע).
                                    </li>
                                    <li><b>סל אשפה</b> (חייב להימצא בכל רכב נוסעים פרטי).
                                    </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol start="5">
                                <li>לבדוק את <b>תקינות הפנסים</b>, השמשות והמגבים ואת ניקיונם. אם אחת מנורות הרכב אינה מאירה, יש להחלפה ולוודא שהנתיך הקשור אליה תקין.
                                </li>
                                <li>לבדוק את <b>הנוזלים והשמנים</b> ברכב, (שמן מנוע, נוזל קירור, נוזל ניקיון השמשות).
                                </li>
                                <li>לבדוק את <b>לחצי האוויר בצמיגים</b>, כולל בצמיג החלופי.
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `שימו לב - יש לנהוג ברכב <b>רק במידה והנהג מכיר את הרכב ואת מערכותיו השונות</b>.  <br>
                                אם זו הפעם הראשונה בה הנך נכנס לרכב מסוים חובה עליך להכיר היטב את מערכות התפעול, לפני תחילת הנסיעה. הכרה ובקיאות במערכות הרכב חיונית. מי שחייב משקפיים, או בעדשות מגע, </b>חייב להרכיבם</b> בכל עת שהוא נוהג ברכב. 
                                `
                            },
                        ],
                        "כיוון המושבים" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/seats1.png`,
                                content: `יש לכוון את מושב הנהג, כך שיתאים למידות גופך ואת משענת הראש, כך שיוכל לתמוך בראשך בעת פגיעה מאחור. כך תוכל להגיע בנוחות אל ההגה, הדוושות ושאר מנופי התפעול ותקבל שדה ראיה מרבי, תפעול נוח ויעיל של מערכות הרכב ונהיגה מעייפת פחות.
                                הקפד על מרחק מתאים מההגה. <br>
                                
                                אחיזה נכונה על ההגה, תאפשר תנועה נכונה של הידיים והפעלה מדויקת של ההגה בסטיות, בעקומות ובפניות.
                                `
                            },
                        ],
                        "כיוון המראות" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/direction1.png`,
                                content: `כוון את מראות הרכב, כך שתוכל לצפות באמצעותן בשטח <b>שמאחורי הרכב ומצידיו</b>. במראה הפנימית עליך לראות את השטח הנשקף מבעד לשמשה האחורית ובהתאם לסוג המראה (פנורמית, או רגילה), לעיתים גם מעט מהשטח שמאחור ומימין. <br>
                                זכור – <b>מראה פנורמית מעוותת את המרחקים הנצפים באמצעותה</b>. המרחקים נראים גדולים מאשר במציאות. את המראות יש לכוון כך, שתוכל לצפות באמצעותן בשטחים הצמודים לדופן הרכב, ובשטח שמימין (או משמאל) לשטח זה, בהתאמה. 
                                `
                            },
                        ],
                        "דליפת גזים מהרכב" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car12.png`,
                                content: `רכב ממנו דולפים גזים הוא <b>מסוכן</b>, כיוון שגזים שייפלטו ממערכת זו עלולים לחדור לתא הנהג ולסכן את הנהג והנוסעים. מכאן גם, <b>שהשארת מנוע פועל בחניון סגור מסוכנת ביותר</b> שכן אין לגזים הרעילים הנפלטים ממנוע הרכב לאן לצאת הם מסכנים את הנהג והנוסעים ברכב.`
                            },
                        ],
                        "לוח המחוונים" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car13.jpg`,
                                content: `לוח המחוונים נועד לתת לנהג מידע על מצב מערכות הרכב, ומצביע על תקלה כלשהי ברכב במידה ויש. לפני היציאה לדרך כדאי להעיף מבט בלוח המחוונים. <br>
                                אם נורית חיווי האיתות ברכב מהבהבת במהירות, ככל הנראה אחד <b>מפנסי האיתות אינו פועל ויש לתקנו לפני היציאה לדרך.</b> <br>
                                אם נדלקת נורית מד חום המנוע, <b>אין להמשיך בנסיעה</b>, אלא לעצור ולאפשר למנוע להתקרר בעמידה בסל"ד נמוך ואם הטמפרטורה אינה יורדת יש <b>לדומם את המנוע</b>.
                                `
                            },
                        ],
                        
                    },
                    "מצב גופני ונפשי": {
                        "מצב גופני ונפשי" : [
                            {
                                cardType: `text`,
                                content: `במידה והנוהג ברכב נמצא במצב גופני או נפשי המונע ממנו שליטה מלאה ברכב, או שהוא עלול לסכן את עצמו או אנשים אחרים בדרך – <b>חל איסור על אותו נהג לנהוג!</b>
                                לדוגמה: לאחר נטילת תרופות הגורמות לקהות חושים, או לתחושת עייפות ונמנום, יהיה מותר לנהוג ברכב רק לאחר שפגה <b>לחלוטין</b> השפעת התרופה.
                                `
                            },
                        ],
                        "עייפות" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/man1.jpg`,
                                content: `עייפות בנהיגה הינה תופעה מוכרת. שעות רבות של נהיגה רציפה, עלולות לגרום לעייפות, נמנום, חוסר ריכוז והתארכות זמן התגובה. <br>
                                במקרים אלה חל איסור מוחלט על הנהיגה ברכב. <br>
                                אם הדבר קורה באמצע הדרך, חובה על הנהג <b>לעצור</b> ל"עצירת רענון" <b>במקום המותר לעצירה ולחניה</b>, 
                                לבצע פעילות גופנית כלשהי, לנוח ולהרבות בשתייה, על מנת להפיג את העייפות הזמנית. <br>
                                יחד עם זאת יש לזכור – זהו פתרון זמני בלבד. עייפות אמתית נגמרת רק בעזרת שינה. ולא ניתן לנהוג במצב עייפות.
                                `
                            },
                        ],
                    },
                    "לפני היציאה לדרך": {
                        "השתלבות לכביש" : [
                            {
                                cardType: `text`,
                                content: `הדרך הבדוקה להימנע מתאונה, בעת ההשתלבות בתנועה, הינה בדיקה מוקדמת של מצב התנועה והערכה נכונה של מהירות ההשתלבות הנדרשת. <br>
                                יש להמתין בסבלנות עד להיווצרות מרווח מספיק ורק אז, לאותת ולהשתלב בתנועה תוך התאמת המהירות למהירות התנועה.
                                `
                            },
                            {
                                cardType: `text`,
                                content: `הערה חשובה לעניין האיתות – איתות כשלעצמו <b>אינו</b> מתיר לנהג לצאת לכביש. האיתות רק מסמן לשאר עוברי הדרך על כוונת הנהג, אך אין הוא מקנה זכות אוטומטית להתחיל בנסיעה. זכות כזו נרכשת רק באמצעות <b>הסתכלות, בדיקת השטח ווידוא כי ניתן לצאת לכביש בבטיחות</b>. 
                                `
                            },
                            {
                                cardType: `text`,
                                content: `אין לנהוג ברכב שרק יד אחת אוחזת בהגה או בכידון הרכב, אלא לשם ביצוע פעולה הנדרשת לנהיגה, כגון הפעלת מנוף האיתות, שילוב הילוך וכו'. <br>אין גם לעשות שימוש במכשיר טלפון סלולארי, שלא באמצעות מיקרופון המותקן ברכב ("דיבורית"), או לחילופין אם הטלפון עצמו מצויד בדיבורית, יש להניחו ברכב באופן יציב, כך שלא יוכל להישמט ממקומו. <br>ובאותו העניין – <b>חל איסור על משלוח מסרונים (SMS) וקבלתם בעת נהיגה</b>, או בעת המתנה <b>בתמרור "עצור"</b>, או <b>ברמזור אדום</b>.
                                `
                            },
                        ],
                    }
                }
            },
            //מצגת 3
            "הנחיות כלליות לגבי תמרור": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `text`,
                                content: `בפרק זה נסקור מספר הנחיות כלליות הנוגעות לדרישות המחוקק לעניין אופק הציות הנדרש מנהגים <b>להוראות והנחיות הניתנות להם ע"י מערכת התמרור</b>. <br>הציות להוראות.
                                `
                            },
                        ],
                    },
                    "שוטרים ותמרורים": {
                        "ציות להוראות בכביש" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/piramid1.png`,
                                content: `נהג וכל משתמש אחר בדרך, חייבים לציית להוראות הניתנות ע"י <b>שוטר, רמזור, תמרור, או סימון בכביש</b>, אולם קיים מדרג המסדיר את ההירארכיה בין כל הגורמים הללו:
                                `
                            },
                            {
                                cardType: `text`,
                                content: `סימונים בכביש, כגון נתיבים, סימון שטחי הפרדה, קו עצירה וכדומה <b>מחייבים את הנהג</b>. כך למשל, חל <b>איסור</b> לנסוע על גבי שטח הפרדה מסומן. <br>
                                דוגמה נוספת- בעת הכניסה לצומת מנתיב מסוים, יש להמשיך בנסיעה בו גם בתוך הצומת, עד ליציאה ממנו.אולם תמרור "כוחו" גדול מכוחו של סימון בכביש. כך למשל מסמן קו עצירה את המקום בו נדרש נהג לעצור, קו העצירה כשלעצמו, אינו מחייב עצירה, אולם בשעה שהוא מסומן ליד תמרור "עצור", הרי שהתמרור, הוא <b>המורה לנהג לעצור</b> ואילו קו העצירה, רק מורה לו <b>היכן לעצור</b>.
                                `
                            },
                        ],
                        "רמזורים" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/3_2.jpg`,
                                content: `<b>הוראות הרמזור</b> גוברות על הוראות התמרור (למעט רמזור צהוב מהבהב המציין תקלה). 
                                `
                            },
                            {
                                cardType: `text`,
                                content: `במרבית הצמתים המרומזרים מוצבים תמרורי "עצור" (לפחות) משני צידיו של הצומת. <br>
                                מטרתם להסדיר את <b>סדר הכניסה לצומת</b> ואת <b>כללי מתן זכות הקדימה בו</b>, בעת שהרמזורים אינם פועלים. <br>
                                אולם בשעה שהרמזורים פועלים והאור הנדלק ברמזור הוא ירוק, רשאי הנהג לחצות את הצומת מבלי לעצור תחילה, למרות קיומו של תמרור "עצור", כלומר הוראות הרמזור גוברות במקרה זה על הוראות התמרור.
                                `
                            },
                        ],
                        "שוטר בצומת מרומזר" : [
                            {
                                cardType: `text`,
                                pic: `../assets/images/pics/police1.jpg`,
                                content: `הוראות השוטר המכוון בצומת, גוברות על כל אלה גם יחד. נהג <b>חייב לציית להוראות שוטר</b>, גם אם הן מנוגדות להוראות הרמזור, תמרור, או סימון בכביש. 
                                `
                            },
                            {
                                cardType: `text`,
                                content: `<b>כיצד נדע מיהו שוטר?</b> 
                                אם הוא לבוש מדים, או שהוא מזדהה באמצעות תעודת מינוי מתאימה, הרי שזהו שוטר שיש לציית להוראותיו. לעניין זה, גם שוטר צבאי הוא שוטר שיש לציית להוראותיו, אולם רק בשעה שהוא <b>במדים ובתפקיד</b>. <br>
                                מכאן ברור, שגם שוטר צבאי במדים, המורה לנהג לנסוע בניגוד להוראת תמרור, יש לציית להוראותיו, שכן הוראותיו גוברות על הוראות התמרור.
                                `
                            },
                        ],
                        "בעלי תפקידים נוספים" : [
                            {
                                cardType: `text`,
                                content: `החוק מכיר בעובדה שלעיתים, יש צורך לציית גם לבעלי תפקידים אחרים, המכוונים את התנועה, לרוב באופן <b>זמני ולמטרה מסוימת</b>. לכן הוא קובע שיש לציית גם להוראותיו של <b>פקח עירוני</b>, אלא שבניגוד לשוטר אזרחי רגיל, חלה חובה זו רק בשעה שהוא לובש מדים ואם הוא הוסמך כדין לתפקידו. <br>
                                ברור מכאן, שהוראותיו של <b>פקח</b> במקרה כזה, גוברות גם על הוראותיו של תמרור. במקרים מסוימים, יש גם חובה לציית להוראותיו של <b>עובד מע"צ </b>- עליו להיות לבוש מדים והוראותיו צריכות להינתן רק לצרכי הכוונת התנועה.
                                `
                            },
                        ],
                    }
                }
            },
            //מצגת 5
            "עקיפה בכביש": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `text`,
                                content: `העקיפה נחשבת לאחת הפעולות המסוכנות ביותר בנהיגה, שכן היא כורכת בתוכה סיכונים רבים, שהעיקרי בהם היא <b>סכנת התאונה החזיתית</b> עם הרכב המגיע ממול. <br>
                                לכן נדרש הנהג לשמור על כמה כללי ברזל בעת שהוא מבקש לעקוף.
                                למרות שאין בחוק הגדרה מדויקת למונח "עקיפה", הרי שבמונח זה הכוונה <u>למעבר על פני רכב הנוסע במהירות איטית יותר, תוך החלפת נתיב לפני המעבר וחזרה לנתיב המקורי אחריו</u>.
                                `
                            },
                            {
                                cardType: `text`,
                                content: `אם אין העקיפה כרוכה בהחלפת נתיבים, היא תכונה לרוב "מעבר על פני רכב אחר", בין שמדובר מצידו השמאלי ובין מצידו הימני, כפי שיוסבר בהמשך.
                                נברר כעת מה חייב נהג לשקול לפני תחילת העקיפה ומהם השלבים לביצוע הנכון והבטוח.
                                `
                            },
                        ],
                    },
                    "עקיפה" : {
                        "כדאיות העקיפה": [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car14.png`,
                                content: `ראשית יש טעם לשקול אם <b>כדאי </b>בכלל לעקוף – לחשוב האם הפרש המהירויות בין הרכב שלפנים לבין המהירות בה מתכוון הנהג לנסוע, הוא כה גדול ואף עובר את המהירות המותרת.  <br> 
                                הזו תהליך ראשוני, הדורש מהנהג שיקול דעת.
                                `
                            },
                        ],
                        "איסורי עקיפה" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car10.png`,
                                content: `שנית יש לבדוק אם העקיפה בכלל <b>מותרת</b>, עקרונית אוסר המחוקק על כל עקיפה ואפילו ניסיון עקיפה, במקומות מסוכנים:
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/sign2.png`,
                                content: `
                                <ol>
                                <li>בכל מקום בו <b>יגרם סיכון לתנועה</b>, או תיגרם <b>הפרעה</b> למשתמש אחר בדרך.
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car15.jpg`,
                                content: `
                                <ol start="2">
                                <li>בכל מקום בו <b>שדה הראיה לפנים מוגבל</b> בכל סיבה שהיא (מבנה הכביש, תנאי מזג האוויר, תאורה וכו').
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/cars1.jpg`,
                                content: `
                                <ol start="3">
                                <li>לפני <b>פסגה</b>, או <b>עקומה בכביש</b>.
                                </li>
                                </ol>`
                                
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/sign2.png`, 
                                content:  `
                                <ol start="4">
                                <li>כשמוצב בכביש <b>תמרור האוסר על עקיפה</b>.
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/view1.jpg`, 
                                content: `
                                <ol start="5">
                                <li>מ – 100 מ' לפני מפגש <b>מסילת ברזל</b> ולפני <b>מעבר חציה</b>.
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/view2.jpg`, 
                                content: `
                                <ol start="6">
                                <li>. <b>בתוך צומת</b> (אלא אם בצומת יותר מנתיב אחד בכיוון נסיעת העוקף והתנועה מתנהלת בטורים).
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/cars2.png`, 
                                content: `
                                <ol start="7">
                                <li>אם נדרש נהג לחצות קו הפרדה רצוף על מנת לבצע את העקיפה, הרי שעקב האיסור על חציית קו ההפרדה, אסור לו לעקוף.
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol start="8">
                                <li>אסור לעקוף (או לנסות לעקוף) <b>רכב עוקף</b>, אלא אם הכביש הוא חד סיטרי ויש בו יותר משני נתיבים באותו כיוון נסיעה.<br>
                                אולם לרכב מסחרי שמשקלו כולל המותר מעל 3500 ק"מ ולאוטובוס שאינו אוטובוס זעיר אסור לעקוף רכב עוקף גם בכביש חד סיטרי שיש בו יותר משני נתיבים באותו כיוון נסיעה.                                
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/view1.jpg`, 
                                content: `
                                <ol start="9">
                                <li>אין לעקוף רכב אחר, <b>שעצר</b> לפני <b>צומת, מעבר חציה, מפגש מסילת ברזל</b>, או שהוא עצר על מנת <b>למלא חובה חוקית</b> אחרת כלשהי.
                                </li>
                                </ol>
                                `
                            },
                        ],
                    },
                    "מעבר על פני רכב אחר": {
                        "מעבר על פני רכב אחר" : [
                            {
                                cardType: `text`,
                                content: `במינוח "מעבר על פני רכב אחר", הכוונה הינה לנסיעה מצידו של רכב אחר, הנע במהירות איטית יותר, אך בניגוד ל"עקיפה", הדבר נעשה ללא שינוי בנתיב נסיעתו של הרכב המהיר יותר. <br>
                                עקיפה מותרת משמאל בלבד.
                                עקרונית מותר לעבור על פני רכב אחר רק מצידו השמאלי (למשל בצומת, כאמור). <br>
                                ישנם אבל מספר מקרים, בהם רשאי רכב לעבור על פני רכב אחר מימין והדבר לא ייחשב כ"עקיפה מימין", שהיא כאמור – אסורה. נפרט חלק ממקרים אלה:
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/pic3.jpg`,
                                content: `
                                <ol>
                                <li>בעת שהרכב לפנים נמצא <b>בנתיב לפניה שמאלה</b>, או שהוא <b>מתכוון לפנות שמאלה</b> והוא מאותת על כוונתו זו.
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol start="2">
                                <li>בפניה שמאלה אל כביש חד סיטרי, או אל כביש שבו יותר מנתיב אחד לאותו כיוון נסיעה. מותר לעבור על פני הרכב הפונה כאשר שהשלים את פנייתו.
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol start="3">
                                <li>בעת נסיעה בנתיב לנסיעה ימינה בלבד, מותר לעבור על פני רכב המצוי שמשמאל.
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/cars3.png`,
                                content: `
                                <ol start="4">
                                <li>בעת שהתנועה מתנהלת בטורים ומחמת צפיפות התנועה, נע הטור הימני במהירות העולה על זו של הטור השמאלי, מותר לטור מימין לנסוע מהר יותר מהטור שמשמאל והדבר לא ייחשב עקיפה אסורה מימין.
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road20.jpg`,
                                content: `
                                <ol start="5">
                                <li>רכב שנוסע <b>בנת"צ</b> (נתיב תחבורה ציבורית).
                                </li>
                                </ol>
                                `
                            },
                        ],
                    },
                    "הרכב הנעקף": {
                        "תשומת לב לסביבה" : [
                            {
                                cardType: `text`,
                                content: `אין בחוק חובה מפורשת להאט תמיד את המהירות בעת שהינך נעקף. אולם לעיתים אין דרך אחרת – הינך נדרש להמשיך בנסיעה, להימין ככל האפשר ולאפשר לעוקף אותך להשלים את עקיפתו בבטחה.
                                `
                            },
                        ],
                    },

                }
            },
            //מצגת 6
            "שמירת מרווח בין רכבים": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `text`,
                                content: `בפרק זה נסקור את הסיבות לשמירת רווח לפנים (למעשה אלו הם הסיכונים שבאי שמירת רווח כיאות). כמו כן נבדוק מהן הדרישות החוקיות המינימליות לרווח זה ומהן השיטות המומלצות לשמירתו.
                                `
                            },
                        ],
                    },
                    "הסיבות לשמירת רווח": {
                        "הסיבות לחשיבות " : [
                            {
                                cardType: `text`,
                                content: `
                                אחת הפעולות החשובות ביותר בנהיגה הינה שמירת רווח מהרכב שלפנים. <br>
                                <b>הסיבות החשובות לכך הן:</b>
                                <ol>
                                <li><b>מניעת תאונת</b> חזית אחור עם הרכב הנוסע לפנים.
                                </li>
                                <li>לאפשר לנהג <b>שדה ראיה</b> מלפנים, בעיקר בעת שהוא נוסע בעקבות רכב גדול ורחב.
                                </li>
                                <li>סיוע במניעת תאונה עם רכב הנוסע מאחור ואינו שומר רווח כנדרש. 
                                נהג המגלה כי הרכב שמאחוריו אינו שומר על רווח כנדרש, יכול להגדיל עוד יותר את המרחק מהרכב שלפנים ובכך <b>לאפשר לעצמו לבלום בהדרגה ובמתינות</b> בעת הצורך ולנטרל מעט את השפעת המרחק הקטן ששומר הנהג שמאחור. 
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol start="4">
                                <li>מתן אפשרות <b>לנהיגה רגועה</b> יותר, שכן הנהג השומר רווח, אינו נדרש להגיב במהירות כה גדולה כמו זה שאינו שומר על רווח מספיק.
                                </li>
                                <li>מניעת <b>בלאי מוגבר</b> לבלמים ולצמיגים וחסכון בדלק, שכן שמירת רווח מאפשרת פעולות האטה והאצה הדרגתיות יותר.
                                </li>
                                <li>מניעת דריכות יתר, עקב אי הצורך להגיב מיידית לפעולות הנהג שלפנים. בכך תורמת שמירת הרווח <b>למניעת מתח בנהיגה </b>ועייפות הנוצרת ממתח זה.
                                </li>
                                <li>הימנעות <b>מפגיעה מחפצים</b> העלולים להישמט מהרכב שלפניו.
                                </li>
                                </ol>`
                            },
                        ],
                    },
                    "כמה רווח יש לשמור ": {
                        "המרחק בין הרכבים" : [
                            {
                                cardType: `text`,
                                content: `מחייב החוק על שמירת רווח <b>שיאפשר עצירה</b> בכל עת, תוך מניעת תאונה, בהתחשב במהירות הנסיעה של הנהג ושל הרכב שלפניו, במצב הדרך מצב הראות ומצב התנועה. <br>
                                בנוסף, נדרש נהג הנוהג בשיירה לשמור על רווח כזה, שיאפשר לעוקף אותו, <b>להיכנס ברווח</b> שבינו לבין ברכב שלפנים. <br>
                                אולם בכך לא כדי – על פי לשון התקנות, חייב נהג לשמור על רווח מינימלי <b>בן שניה אחת </b>מהרכב שלפניו.
                                `
                            },
                            {
                                cardType: `text`,
                                content: `מה הקשר בין חובת שמירת רווח, הנמדד <b>ביחידות מרחק</b> (כגון מטרים), לבין הוראות החוק הקובעות שמירת רווח <b>ביחידות של זמן </b>(שניות)?<br>
                                בכל יחידת זמן (שניה למשל), עובר רכב מרחק מסויים שגודלו משתנה בהתאם למהירות הרכב. לו היה המחוקק נדרש להורות לנהג איזה מרחק (במונחי "מטרים") לשמור בכל מהירות, הרי שהיה הוא נדרש לציין רשימה ענקית של "מטרים" לכל מהירות נסיעה אפשרית. היתרון בהגדרת רווח במונחי זמן הינו באחידות ובפשטות.
                                `
                            },
                            {
                                cardType: `text`,
                                content: ` די שיגדיר המחוקק את מספר השניות הנדרשות ואוטומטית, ישתנה המרחק שהן מבטאות, בהתאם למהירות הרכב. זהו מעין "תרגום" של <b>מרחק התגובה הממוצע של הנהג</b> (כ – ¾ השניה), בתוספת <b>מרווח בטחון קטן</b> נוסף, למונחי זמן (שניות).
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car14.png`,
                                content: `יחד עם זאת <u>מומלץ לנהג לשמור על רווח של <b>שתי שניות</u></b> ולא להסתפק בשניה המינימלית האחת, אותה מחייבות התקנות.<br>
                                לעיתים כשקיימים תנאי תאורה או ראות קשים (למשל תנאי מזג אוויר קשים), <b>יש אפילו להגדיל את המרחק מהרכב שלפנים</b>.
                                `
                            },
                        ],
                    },
                }
            },
            //מצגת 7
            "נהיגה במהירות גבוהה": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `text`,
                                content: `בפרק זה נלמד מהי הסכנה שבנהיגה <b>במהירות גבוהה</b>, נפרט את המקרים בהם נדרשת <b>חובת האטה </b>ואת <b>המהירויות המותרות</b> לכלי רכב שונים בסוגים שונים של דרכים.
                                `
                            },
                        ],
                    },
                    "הסכנה שבנהיגה במהירות גבוהה": {
                       "הסכנות" : [
                            {
                                cardType: `text`,
                                content: `נהיגה במהירות גבוהה מסוכנת ביותר, בעיקר כזו שאינה תואמת את <b>תנאי הדרך, התנועה, הראות ומזג האוויר</b>.<br>
                                עוצמת המכה במקרה תאונה, גדלה בהרבה מעבר לגידול במהירות, כלומר הגדלת המהירות פי 2, לדוגמה, תגדיל את עוצמת המכה בהתנגשות הרבה מעבר לפי 2 (עוצמת המכה גדלה בריבוע לגידול במהירות). מכאן <b>שהפגיעה</b> בבני אדם, או הנזק לרכוש במקרה תאונה, <b>יהיו חמורים יותר, ככל שתגדל מהירות הנסיעה</b>.
                                `
                            },
                            {
                                cardType: `text`,
                                content: `ככל שמהירות הנסיעה עולה, נדרש הנהג להגיב לקורה בדרך בפרק זמן קצר יותר, דבר העלול לפגום בכושרו להגיב באופן נכון לאירועים שבדרך וכן להספיק ולסיים את תגובתו בזמן. <br>במילים אחרות, <b>סכנת אובדן השליטה ברכב, הולכת וגדלה עם הגידול במהירות הנסיעה</b>.
                                `
                            },
                            {
                                cardType: `text`,
                                content: `הבלאי למערכות הרכב, כמו גם תצרוכת הדלק, גדלים משמעותית בעת נהיגה במהירויות גבוהות. <br>
                                נהיגה במהירות שלא תדרוש בלימות חזקות והאצות חזקות אחר כך, <b>תתרום משמעותית לחסכון בדלק</b>.
                                `
                            },
                        ],
                    },
                    "מהירות הנסיעה המותרת": {
                       "המהירות המותרת - בכלליות" : [
                            {
                                cardType: `text`,
                                content: `יש לנהוג במהירות סבירה, המאפשרת <b>שליטה</b> ברכב, תוך התחשבות בכל הנסיבות, בתנאי הדרך ובמצב התנועה, ובכל מקרה <b>לא יותר מהמהירות המירבית המותרת</b> על פי סוג הרכב וסוג הדרך. <br>
                                קובעות התקנות כי על הנהג להאט את מהירות נסיעתו, עקב הופעתם בדרך של סיכונים מסוימים.
                                `
                            },
                        ],
                    },
                    "האטה ובלימה מתי וכיצד?": {
                        "האטה ובלימה" : [
                            {
                                cardType: `text`,
                                content: `עקרונית חייב נהג להאט את מהירות נסיעתו ואפילו לעצור את רכבו, כל עוד צפויה סכנה לעוברי דרך או לרכוש. <br>
                                לא תמיד חלה חובת עצירה – במרבית המקרים, די בהאטה, אולם אם אין דרך אחרת למנוע סכנה <b>יש לעצור</b>.
                                `
                            },
                        ],
                        "חובת האטה" : [
                            {
                                cardType: `text`,
                                content: `
                                <b>התקנות מונות שורת מקרים בהם חלה חובת האטה מיוחדת:</b>
                                <ol>
                                <li><b>בשטחים בנויים, מאוכלסים</b> וכשהולכי רגל נמצאים או הולכים בדרך, ליד <b>התקהלות אנשים</b>
                                ובפרט ילדים ובהתקרבות לבעלי חיים.
                                </li>
                                <li><b>כשהראות מוגבלת</b> מכל סיבה שהיא.
                                </li>
                                <li>לפני <b>פסגה</b>, לפני <b>עקומה, במורד תלול וארוך</b>, לפני <b>גשר צר</b>.
                                </li>
                                <li>לקראת <b>מעבר חציה</b> ולפני <b>אוטובוס</b>, העומד בתחנה, או לקראת "טיולית" או אוטובוס <b>המעלים או מורידים נוסעים</b>.
                                </li>
                                <li><b>ברחוב משולב</b>.
                                </li>
                                <li>באזור <b>מיתון תנועה</b>.
                                </li>
                                <li><b>במנהרה</b>.
                                </li>
                                </ol>
                                `
                            },
                        ],
                        "בלימת רכב" : [
                            {
                                cardType: `text`,
                                content: `בלימת רכב נוצרת, כתוצאה מהחיכוך הנוצר בין רפידות הבלם לדיסק (או לתוף). <br>
                                בעת הבלימה נוצר <b>חום רב</b>. זו דרכה של הפיזיקה להמיר את אנרגית <b>התנועה</b> באנרגיה מסוג אחר (תרמית) <b>ובכך לבלום את הרכב</b>.<br>
                                אולם חימום יתר של הבלמים, עלול לגרום <b>לירידה דרסטית בכושרם לבלום את הרכב</b>. <br>
                                הדבר עלול לקרות למשל בעת נסיעה במורד ארוך, כשהנהג מפעיל את הבלמים ברציפות, למשך פרק זמן ארוך. 
                                `
                            },
                            {
                                cardType: `text`,
                                content: `<b>כיצד לשים לב לכך?</b><br>
                                הנהג יכול לחוש באמצעות <b>הריח החריף</b> שמותירים אחריהם בלמים המתחילים לייצר חום רב מידי.<br>
                                מהרגע שהנהג גילה זאת, מותר לו להמשיך לנסוע <b>באיטיות</b>, אם הדרך אינה מושפעת, על מנת לאפשר לבלמים להצטנן. כמובן במקרים קיצוניים, <b>יש לעצור את הרכב בצד הכביש</b> ולהמתין עד להצטננות הבלמים.
                                `
                            },
                        ],
                        "בלימת חירום" : [
                            {
                                cardType: `text`,
                                content: `בשעת הצורך יש לבלום באופן הדרגתי. <br>
                                בלימת חירום מותרת רק <b>למניעת תאונה</b>, שאין כל דרך אחרת למנועה, או שהדבר נחוץ עקב <b>סיבות בטיחותיות</b>.<br>
                                ויודגש – בלימת חירום לצורך ניסוי בלמים מותרת רק לאחר שנקט הנהג בכל אמצעי הזהירות הדרושים והבטיח שהניסוי <b>אינו גורם לסיכון או הפרעה</b> לעוברי דרך אחרים.
                                `
                            },
                            {
                                cardType: `text`,
                                content: `בלימת חירום אינה מומלצת אף פעם. על מנת להימנע ממנה, על הנהג לנהוג במהירות התואמת את תנאי הדרך והתנועה, לשמור מרחק מהרכב שלפניו ולהסתכל רחוק קדימה, על מנת שיבחין מוקדם ככל האפשר באותם גורמים העלולים לגרום לו לבלום.
                                `
                            },
                        ],
                        "מרחק עצירה" : [
                            {
                                cardType: `text`,
                                content: `
                                <b>מרחק העצירה של הרכב מורכב ממספר מרכיבים:<b><br>
                                <ol>
                                <li><b>מרחק התגובה </b>– המרחק שעובר הרכב מרגע שהבחין הנהג בסכנה ועד שהחל בפעולת התגובה (למשל, עד שהניח את רגלו על דוושת הבלם).
                                </li>
                                <li><b>מרחק הבלימה</b> – המרחק שעובר הרכב מרגע שהופעלו הבלמים (מרגע שנלחצה דוושת הבלימה) ועד לעצירתו המוחלטת של הרכב.
                                </li>
                                <li><b>מרחק העצירה</b> – מרחק התגובה + מרחק הבלימה. ככל שגדלה מהירות הנסיעה, כן גדל מרחק התגובה ועוד יותר מכך – מרחק הבלימה.
                                </li>
                                </ol>`
                            },
                        ],
                    },
                    "מהירות כלי רכב שונים על פי סוג הדרך ": {
                        "מהירויות לפי כלי רכב ואזורים" : [
                            {
                                cardType: `text`,
                                content: `לעיתים מגבילה רשות הרישוי את מהירותם המירבית המותרת של כלי רכב מסויימים והיא מציינת הגבלה זו ברישיון הרכב שלהם. <br>
                                לכלי רכב אלה, אסור כמובן לנסוע במהירות העולה על זו המצויינת ברישיון הרכב.<br>
                                מהירותם המירבית של <b>רכב איטי, טרקטור ומכונה ניידת</b> מוגבלת ל- <b>40 קמ"ש</b>. מכאן שזוהי המהירות המירבית בה יוכלו כלי רכב אלה לנוע הן בדרך עירונית והן בדרך שאינה עירונית. <br>
                                לכלי רכב אלה <b>אסורה הכניסה לדרך מהירה</b>.
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/table1.png`,
                                content: `
                                <ul>
                                <li>כל משקל המצוין בטבלה הוא "משקל כולל" המותר עפ"י החוק.
                                </li>
                                <li>דרך שמוצב בה תמרור של מהירות מיוחדת אין לעבור אותה.
                                </li>
                                <li>למשאית מעל 12 טון אסור לעבור את המהירות המותרת גם אם תמרור "מהירות מיוחדת" מתיר מהירות גבוהה יותר.
                                </li>
                                </ul>`
                            },
                        ],
                    },
                    
                }
            },
            "מסילת רכבת": {
                learningContent: {
                    "הקדמה": {
                       "הקדמה" : [
                            {
                                cardType: `text`,
                                content: `תאונות רבות אירעו בארץ בין כלי רכב לרכבת ומכאן ההוראות החמורות הנוגעות לנושא זה. <br>
                                בפרק זה נסקור את שאמור הנהג לעשות בהתקרבות למפגש מסילת ברזל ובעוברו על פניו.
                                `
                            },
                        ],
                    },
                    "מפגש מסילת רכבת": {
                       "התקרבות למסילת רכבת" : [
                            {
                                cardType: `text`,
                                content: `בהתקרבותך אל מפגש מסילת ברזל עלייך:
                                <ol>
                                <li><b>להאט</b> את מהירותך, כך שתוכל לעצור בעת הצורך, בעיקר כשמדובר במפגש המצויד במחסום, רמזור, או אות אזהרה אחר.
                                </li>
                                <li><b>להימנע מעקיפה</b> בטווח של <b>100 מטר</b> לפני המפגש.</li>
                                <li><b>אין לחנות</b> במרחק של <b>20 מטר</b> ממפגש מסילת ברזל. 
                                </li>
                                </ol>
                                `
                            },
                        ],
                        "הגעת הרכבת" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/view1.jpg`,
                                content: `כשהרכבת נראית לעיניו, נשמעת לאוזניו של נהג המתקרב למפגש מסילת ברזל, שרכבת משמיעה אות אזהרה, או שניתן אות אזהרה כלשהו ליד מקום מפגש, על הנהג <b>לעצור מיד</b> ולא להמשיך בנסיעה עד <b>אחרי שהרכבת עברה</b>, או <b>שנפסק אות אזהרה</b> (רמזור). 
                                `
                            },
                            {
                                cardType: `text`,
                                content: `כשמוצב תמרור "עצור" לפני המפגש חובה עליך לא רק לעצור, אלא גם <b>לכבות</b> את מכשיר הרדיו\ טייפ\ דיסק\ טלוויזיה, לפתוח את החלון הקרוב, <b>להתבונן ולהאזין</b> ורק לאחר שווידאת שרכבת אינה מתקרבת מכל כיוון, רק אז מותר לך להמשיך בדרכך.<br>
                                כשמחסום הרכבת חוסם את הדרך, חלק ממנה, או נע (בין שהוא עולה בין שהוא יורד) וכל עוד הוא בתנועה – יש לעצור <b>לפני קו העצירה</b> או <b>לפני המחסום הקרוב</b>. <br>
                                אם לא מסומן קו עצירה, יש לעצור לפני המחסום, ואם אין מחסום, <b>במרחק של 4 מטר</b> מהפס הקרוב לפחות.
                                `
                            },
                        ],
                    },
                }
            },
            //מצגת 9
            "איתות כדרך תקשורת בכביש": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/car16.png`,
                                content: `האיתות מהווה מעין תקשורת בין נהגים. בעזרתו מודיע נהג אחד ליתר המשתמשים בדרך, על כוונותיו. <br>בפרק זה נבין מה משמעות <b>האיתות</b>, מתי חובה לאותת, מתי רצוי לאותת, ומהם האמצעים בהם יש לבצע זאת. `
                            },
                        ],
                    },
                    "מתי לאותת?": {
                        "מתי לאותת?" : [
                            {
                                cardType: `text`,
                                content: `יש לאותת זמן מספיק (באופן סביר), על מנת לאפשר לעוברי דרך אחרים להבין את כוונת הנהג המאותת ולהגיב לה כיאות. <br>
                                במקביל, חייב עובר דרך אחר, בעיקר נהג הנוסע בעקבותיו, שהבחין באיתות, <b>לאפשר</b> לנהג שאותת להשלים את הפעולה אותה התכוון לבצע <b>ואפילו להאט או לעצור</b>, על מנת לסייע לו בכך.
                                `
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol>
                                <li>בשעה שהוא מתכוון <b>להתחיל בנסיעה</b>. 
                                </li>
                                <li>בשעה שהוא מתכוון <b>לסטות מנתיב נסיעתו</b>. 
                                </li>
                                <li>בשעה שהוא מתכוון <b>לפנות</b>.</li>
                                <li>בשעה שהוא מתכוון <b>להאט או לעצור</b>.
                                </li>
                                </ol>`
                            },
                        ],
                    },
                    "תקלה במערכת האיתות": {
                        "תקלה במערכת האיתות" : [
                            {
                                cardType: `text`,
                                content: `האיתות בכלי הרכב המודרניים, הינו חשמלי. אולם כשמתגלה תקלה במערכת האיתות, רשאי הנהג להמשיך בנסיעה עד לתיקון התקלה, תוך שהוא <b>מאותת באופן ידני</b>.
                                `
                            },
                            {
                                cardType: `text`,
                                content: `<b>כיצד לאותת באופן ידני?</b>
                                <ul>
                                <li><b>תחילת נסיעה</b> - הוצאת יד עד המרפק בקו אופקי.
                                </li>
                                <li><b>סטייה שמאלה או פניה שמאלה</b> - הוצאת יד עד המרפק בקו אופקי.
                                </li>
                                <li><b>סטייה ימינה או פניה ימינה</b> - סיבוב היד בכיוון השעון.
                                </li>
                                <li><b>האטה או בלימה</b> - הנעה מעלה ומטה של היד השמאלית.
                                </li>
                                </ul>
                                מותר, אם נסיבות העניין מורות על כך, להוסיף איתות ידני בנוסף לאיתות החשמלי.

                                `
                            },
                        ],
                        "אמצעי האיתות העומדים לרשות הנהג" : [
                            {
                                cardType: `text`,
                                content: `
                                <ol>
                                <li><b>מחווני כיוון</b> - בהם יעשה שימוש לפני תחילת נסיעה, לפני סטייה ולפני פניה.
                                </li>
                                <li><b>הבלם</b> - בו יעשה שימוש בהאטה ולפני עצירה.  
                                </li>
                                <li><b>צופר הרכב</b> - המהווה גם הוא אמצעי אזהרה מפני סכנה.
                                </li>
                                </ol>`
                            },
                        ],
                    },
                }
            },
            //מצגת 10
            "רכב ביטחון": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `threePicsAndText`,
                                pic1: `../assets/images/pics/car1.png`,
                                pic2: `../assets/images/pics/car2.png`,
                                pic3: `../assets/images/pics/car3.png`,
                                content: `הפרק ידון <b>בחובותיו</b> של הנהג כלפי <b>רכב ביטחון</b> ובזיהויו של רכב כזה. <br>
                                רכב משטרה, אמבולנס, רכב כיבוי אש ורכב צה"לי, בעת שהם <b>מאירים באור מהבהב</b> (כחול, כחול- אדום, או אדום) ומשמיעים אות אזעקה (סירנה), יוגדרו כ"רכב ביטחון בתפקיד". 
                                `
                            },
                        ],
                    },
                    "נהיגה בסביבת רכב ביטחון": {
                       "נהיגה ליד רכב ביטחון" : [
                            {
                                cardType: `text`,
                                content: `בראותך רכב ביטחון מתקרב, עליך <b>להימין</b> ככל האפשר לשפת הכביש, לעצור שלא בתוך צומת ולתת זכות קדימה לרכב הביטחון. <br>
                                בנסיעה אחרי רכב ביטחון, יש לשמור ממנו <b>מרחק</b> של 100<b> מ' לפחות</b>. <br>
                                הולכי רגל נדרשים <b>לפנות</b> מיד את הכביש בהתקרב רכב ביטחון. 
                                `
                            },
                            {
                                cardType: `text`,
                                content: `הופעת רכב ביטחון מאחוריך, <b>אינה מתירה</b> לך לחצות צומת באור אדום. <br>
                                עלייך להמתין למופע האור הירוק ורק אז לחצות את הצומת, לעצור בצד הדרך ולתת לרכב הביטחון לעבור. <br>
                                שים לב- רכב ביטחון בתפקיד <b>רשאי לנוע בכביש חד סטרי</b>, בניגוד לכיוון התנועה. 
                                `
                            },
                        ],
                    },
                }
            },
            //מצגת 12
            "צומת": {
                learningContent: {
                    "הקדמה": { 
                        "הקדמה" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road17.jpg`,
                                content: `בפרק זה נכיר את הבעייתיות המאפיינת את הצומת ואת הדרכים הנכונות להתקרב אליו ולחצותו בבטחה.`
                            },
                        ],
                    },
                    "הבעיות המאפיינות את הצומת": {
                        "סיכונים בצומת" : [
                            {
                                cardType: `text`,
                                content: `<b>הצומת והדרכים המובילות אליו, מאופיינים במספר רב של סיכונים ובעיות:</b>
                                <ol>
                                <li><b>נפח תנועה גדול יותר</b>, שכן אל הצומת מתנקזים מספר כבישים. כמויות הרכבים הגדולות יותר, שחלקם נוסעים בכיוונים היוצרים פוטנציאל <b>התנגשות</b> עם כלי רכב אחרים. בנוסף, נוטים כלי הרכב לשמור על <b>רווחים קטנים יותר</b> ביניהם בצמתים. הנהג נדרש להגיב מהר ונכון, בפרק זמן קצר לפעולותיהם הנכונות והשגויות של יתר הנהגים.
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol start="2">
                                <li><b>מספר גבוה של הולכי רגל</b> המתרכזים בצומת. יש לזכור- בצמתים מרוכזים מעברי החציה והולכי רגל נוטים לחצות כבישים בצמתים ובקרבתם. חלקם חוצים את הכביש כחוק וחלקם לא. באלה וגם באלה <b>חייב הנהג להתחשב</b>. 
                                </li>
                                <li><b>ריבוי תמרורים</b> לקראת הצומת ובתוכו, דבר המחייב את הנהג לקלוט את כולם, לזהות את משמעותם ולפעול על פיהם, <b>הכל בפרק זמן קצר יחסית</b>. 
                                </li>
                                </ol>`
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol start="4">
                                <li>על הנהג לבצע <b>מטלות רבות בזמן קצר יחסית</b>, תוך שהוא חייב לקלוט בפרק זמן קצר זה את כל המידע הרלוונטי לגביו - כבישים, כיווני תנועה, כלי רכב, עוברי דרך אחרים וכו.
                                </li>
                                <li><b>פני הכביש בצמתים</b>, עלולים לא פעם להיות <b>חלקים יותר</b>, עקב שחיקת צמיגי המכונית העוצרות בצומת ובקרבותו, סימוני הכביש, מעברי חציה ועוד. כתוצאה מכך, עלול <b>נסיון עצירה בצומת להיות מסוכן יותר</b>, מאשר עצירה בכביש רגיל. 
                                </li>
                                </ol>`
                            },
                        ],
                    },
                    "כיצד להתקרב אל הצומת": {
                        "התקרבות לצומת" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road9.png`,
                                content: `נהג המתקרב לצומת, על שלל הבעיות והסיכונים שבו, חייב להתחשב בסוג הרכב הוא נוהג, מטענו, משקלו, יכולת התימרון שלו ומצב התנועה שלפניו.`
                            },
                        ],
                        "התמודדות עם סכנות הצומת" : [
                            {
                                cardType: `text`,
                                content: `
                                <ol>
                                <li><b>להאט</b> את המהירות הנסיעה לקראת הצומת.</li>
                                <li><b>להתבונן רחוק</b> לשם איתור סיכונים קרובים. 
                                </li>
                                <li><b>לבדוק</b> לפני הכניסה לצומת <b>אם ניתן לצאת ממנו</b> מבלי להיעצר במרכזו עקב מצב התנועה. 
                                </li>
                                <li>להשתדל ולבצע חלק מהפעולות (כגון הורדת הילוכים), כבר בהתקרבות אל הצומת ולא בתוכו. 
                                </li>
                                </ol>
                                זכור - הינך מבחין בצומת זמן רב לפני שהינך מגיע אליו, באמצעות התמרורים השונים המורים על ההתקרבות אליו. 
                                `
                            },
                        ],
                        "נהיגה בצומת": {
                            "נהיגה בתוך צומת" : [
                                {
                                    cardType: `text`,
                                    content: `<b>חל איסור על עקיפה בתוך תחום הצומת</b>.<br>
                                    אולם אם טור הרכבים <b>הימני נע מהר יותר</b> מהטור השמאלי, לא ייחשב הדבר כעקיפה.
                                    `
                                },
                            ],
                        },
                    },
                }
            },
            //מצגת 13
            "מתן זכות קדימה": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `twoPicsAndText`,
                                pic1: `../assets/images/pics/sign3.png`,
                                pic2: `../assets/images/pics/sign4.png`,
                                content: `הפרק ייתמקד במתן זכות קדימה.
                                נגדיר מהם המקרים בהם חייב נהג רכב אחד לתת זכות קדימה לאחר. <br>זכור- זכות הקדימה לעולם אינה זכות שחובה לנצל, אולם מתן זכות קדימה, הינה חובה שיש לקיימה, במקרים בהם נדון. 
                                `
                            },
                        ],
                    },
                    "זכות קדימה": {
                        "הגדרה" : [
                            {
                                cardType: `text`,
                                content: `<b>מתן זכות קדימה</b>- הזכות שעל נוהגים ברכב לתת למשתמשים אחרים בדרך, על מנת לשמור על הסדר ועל בטיחותם של הנמצאים בכביש. <br>
                                זכות הקדימה ניתנת לכלי רכב אחרים וגם להולכי רגל. 
                                `
                            },
                        ],
                    },
                    "זכות קדימה בצומת": {
                        "זכות הקדימה בצומת" : [
                            {
                                cardType: `text`,
                                content: `כללי זכות הקדימה בצמתים מוסדרים באמצעות הרמזורים והתמרורים. 
                                רמזור אדום ותמרור עצור, <b>מחייבים עצירה</b>.
                                במקום בו ניתן לראות את התנועה ואם סומן במקום קו עצירה, יש לעצור <b>לפניו</b> ובנוסף - יש לתת זכות קדימה לכלי הרכב האחרים הנמצאים בצומת או מתקרבים אליו.<br> 
                                תמרור "תן זכות קדימה", <b>מחייב מתן זכות קדימה</b>, כלומר האטה ואפילו עצירה (שוב - במקום בו ניתן לראות את התנועה ואם סומן קו עצירה, לפני קו העצירה), על מנת לתת זכות קדימה לתנועה בדרך החוצה. 
                                `
                            },
                            {
                                cardType: `text`,
                                content: `יתר כללי זכות קדימה בצומת, חלים בכל אותם המקרים בהם <b>לא מוצבים רמזורים, או תמרורים</b> בצומת ואז:
                                <ol>
                                <li>בהתקרבות לצומת, יש לתת זכות קדימה לרכב הבא <b>מימן</b>. 
                                </li>
                                <li>במידה והנהג צריך לפנות שמאלה, עליו לתת זכות קדימה <b>לרכב הבא מולו</b> (ואין זה משנה כלל, לאן הרכב שמולו מתכוון לנסוע). 
                                </li>
                                </ol>
                                זכור- שני הכללים הנ"ל מצטברים, כלומר רכב המתכוון לפנות שמאלה בצומת שאינו מרמזור או מתומרר, יתן זכות קדימה לרכב שמימינו וגם לרכב ממולו. 
                                `
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road21.jpg`,
                                content: `
                                <ol start="3">
                                <li>כשנדלק ברמזור <b>אור צהוב מהבהב</b>, לפני מעבר חציה משמעו חובת מתן זכות קדימה <b>להולכי הרגל החוצים</b>.</li>
                                <li>ככלל - אין להיכנס כלל לצומת, אלא אם בטוח הנהג <b>שיוכל להשלים את חצייתו</b> ולא ייעצר בתוך הצומת. 
                                </li>
                                </ol>`
                            },
                        ],
                    },
                    "מפגשים שאינם צמתים": {
                        "זכות הקדימה לא בצומת" : [
                            {
                                cardType: `text`,
                                content: `
                                <ol>
                                <li>רכב היוצא מדרך עפר, משביל גישה לבית, או מחצר, מדרך גישה לתחנת דלק, יתן זכות קדימה <b>לתנועה בדרך סלולה</b>. <br>
                                זכור- מפגש של דרך עפר עם כביש, אינו מוגדר "צומת", אלא אם <b>מוצב במקום תמרור</b> המעיד על מפגש כי הוא "צומת" בהגדרתו בתקנות. 
                                </li>
                                <li>רכב היוצא משביל גישה לבית, או מחצר <b>ומתכונן לחצות מדרכה</b> יתן זכות קדימה <b>להולכי הרגל שבמדרכה</b> ובמידת הצורך, יעצור, על מנת לאפשר להם לעשות שימוש בטוח במדרכה. 
                                </li>
                                <li>על נוהג המגיע <b>להתמזגות עם כביש שבו זכות קדימה</b> (לרוב מדובר בנתיב האצה, או מעין נתיב האצה), לתת זכות קדימה <b>לתנועה בכביש</b> אליו הוא מתמזג. 
                                </li>
                                </ol>`
                            },
                        ],
                    },
                    "בעת נסיעה בכביש": {
                        "זכות קדימה בזמן נסיעה בכביש" : [
                            {
                                cardType: `text`,
                                content: `
                                <ol>
                                <li>לפני תחילת הנסיעה, יש לתת זכות קדימה לתנועה <b>הנוסעת בכביש</b>. 
                                </li>
                                <li>רכב הנוסע במורד תלול, יתן זכות קדימה <b>לרכב העולה</b>. 
                                </li>
                                <li>רכב שנתיבו נחסם, יתן זכות קדימה לרכב <b>המגיע ממול ושנתיבו פנוי</b>. 
                                </li>
                                <li>רכב שנתיב נסיעתו מסתיים, תוך שהוא "מתמזג"  עם נתיב סמוך, יתן זכות קדימה <b>לכלי הרכב בנתיב אליו הוא מתמזג</b>. 
                                </li>
                                <li>נהג המתקרב למעבר חציה, שהולכי הרגל עושים בו שימוש באותו הזמן, <b>יאט ואף יעצור</b> על מנת לתת להם זכות קדימה ולאפשר להם להשלים את חצית הכביש בבטחה.
                                </li>
                                </ol>`
                            },
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/raod22.jpg`,
                                content: `אם הכביש מחולק באמצעות שטח הפרדה, רואים כל חלק משני עברי שטח ההפרדה ככביש נפרד. <br>
                                מכאן אנו מבינים שיש לתת זכות קדימה <b>להולכי רגל החוצים בכל מקטע של הכביש כחלק נפרד</b>.
                                `
                            },
                        ],
                        
                    },
                }
            },
            //מצגת 18
            "תאונות דרכים וחובות הנהג": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/accident.png`,
                                content: `בפרק זה נסקור את חובותיו של נהג רכב בשני מקרים:
                                <ol>
                                <li>בעת שהוא עובר ליד מקום תאונת דרכים, שבה הוא <b>אינו מעורב</b> כלל.
                                </li>
                                <li>בעת שהוא <b>מעורב</b> בעצמו בתאונת דרכים.
                                </li>
                                </ol>
                                `
                            },
                        ],
                    },
                    "הנהג לא מעורב בתאונה": {
                        "הנהג לא מעורב בתאונה" : [
                            {
                                cardType: `text`,
                                content: `נהג המגיע למקום תאונת הדרכים, יעצור את רכבו בצד הדרך, יגיש לנפגעים <b>עזרה</b> כמידת הכשרתו הרפואית, <b>ירחיק</b> את הסקרנים שמסביב וידאג <b>להזעיק את שירות ההצלה</b>. 
                                `
                            },
                        ],
                    },
                    "הנהג מעורב בתאונה": {
                        "הנהג מעורב בתאונה" : [
                            {
                                cardType: `text`,
                                content: `כשהנהג עצמו מעורב בתאונה, עליו למסור את <b>שמו, כתובתו ומספר תעודת הזהות</b> שלו לכל אדם שהיה מעורב בתאונה (גם אם אינו נהג, אלא רק נוסע ברכב אחר) וכן להציג בפניהם את <b>רישיון הנהיגה, רישיון הרכב ותעודת ביטוח חובה</b>.
                                `
                            },
                        ],
                    },
                    "סוגי תאונות דרכים": {
                        "תאונה עם נפגעים" : [
                            {
                                cardType: `text`,
                                content: `בנוסף למסירת הפרטים והצגת מסמכים:
                                <ol>
                                <li><b>אין להזיז</b> את כלי הרכב המעורבים בתאונה, אלא לפי הוראות שוטר, או לשם פינוי נפגע לבית חולים, כשאין כל דרך אחרת לעשות זאת, אלא רק באמצעות אחד כלי הרכב המעורבים בתאונה. 
                                </li>
                                <li>אדם שלא מעורב בתאונה יגיש לנפגעים עזרה כמידת הכשרתו הרפואית <b>וידווח למשטרה</b> מוקדם ככל האפשר. 
                                </li>
                                </ol>
                                `
                            },
                        ],
                        "תאונה ללא נפגעים – נזק לרכוש" : [
                            {
                                cardType: `text`,
                                content: `בנוסף למסירת הפרטים והצגת מסמכים: <br>
                                <b>חובה להזיז את כלי הרכב</b>, על מנת שלא יפריעו לזרימה התקינה של התנועה בדרך. 
                                `
                            },
                        ],
                        "תאונה עם רכוש ללא בעלי הרכב" : [
                            {
                                cardType: `text`,
                                content: `למשל בעת פגיעה ברכב חונה, שנהגו לא נמצא לידו או בגדר בית וכו. <br>
                                על הנהג להשאיר במקום בולט על הרכוש עצמו (למשל מתחת למגב השמשות ברכב הנפגע) דף שבו יציינו <b>פרטיו האישיים של הנהג הפוגע</b> וכיצד ניתן לאתרו וכן עליו <b>להודיע</b> על התאונה <b>תוך 24 שעות</b> לתחנת משטרה, אלא אם היה במקום התאונה שוטר וההודעה נמסרה לו במקום. 
                                `
                            },
                        ],
                    },
                    "אפוד זוהר": {
                        "החזקת אפוד זוהר" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/pic.jpg`,
                                content: `ברכב מנועי למעט אופנוע, יימצא אפוד זוהר העומד בדרישות התקן. האפוד יימצא בתא הנהג, נוהג רוכב או נוסע היוצא ונמצא מחוץ לרכב <b>בדרך בינעירונית</b> בסמך לכביש (למעט מדרכה) או בשולי הדרך לשם תיקון או בדיקת הרכב <b>ילבש</b> אפוד זוהר, יתר הנוסעים יתרחקו מהכביש ככל האפשר. 
                                `
                            },
                        ],
                    },
                }
            }
            
        }
    },
    
    "": {
        /* cardType: `picAndText`,
          pic: `../assets/images/pics/x.png`, **/
        "" : [
            {
                cardType: `text`,
                content: ``
            },
        ],
    },


    "בטיחות": {
        "icon": "",
        "questions": [],
        lessons: {
            //מצגת 11
            "תאורה ותנאי נהיגה בלילה": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `text`,
                                content: `בפרק נדון בקשיי הנהיגה בלילה ובכל זמן אחרי בו תנאי הראות לקויים. <br>
                                כמו כן יובהרו המונחים הקשורים בתאורת הרכב וכללי הפעלתם. 
                                `
                            },
                        ],
                    },
                    "זמן תאורה ולילה ": {
                        "מושגים" : [
                            {
                                cardType: `text`,
                                content: `"<b>זמן תאורה</b>"- זמן הלילה וכן זמן אחר שבו <b>הראות לקויה</b> מחמת תנאי מזג האויר, או מחמת סיבות אחרות.
                                <br>
                                "<b>לילה</b>"- פרק הזמן שבין תום רבע שעה לאחר שקיעת השמש לבין תחילת רבע שעה לפני הזריחה. 
                                `
                            },
                        ],
                    },
                    "נהיגת לילה": {
                        "הסיכונים בנהיגה בלילה" : [
                            {
                                cardType: `text`,
                                content: `
                                <ol>
                                <li>שדה ראיה <b>מוגבל</b>.
                                </li>
                                <li>קשיים באומדן מרחק ומהירות</b> של כלי רכב אחרים.
                                </li>
                                <li><b>סינוור</b> מהרכב הבא ממול ומהרכב הנוסע מאחור.
                                </li>
                                <li>תיתכן גם <b>עייפות</b> מתגברת.
                                </li>
                                </ol>`
                            },
                        ],
                        "מהירות ותאורה" : [
                            {
                                cardType: `text`,
                                content: `נהג הנוהג בלילה, או בעת שהראות לקויה מחמת תנאי מזג אוויר קשים למשל, <b>יאט</b> את מהירות נסיעתו. <br>
                                יתרה מזאת, מהירותו צריכה להיות כזו שתהיה תואמת את <b>טווח האורות</b>. <br>
                                <b>אין לנהג ברכב שאורותיו אינם תקינים. </b>
                                `
                            },
                        ],
                        "המנעות אישית מסינוור" : [
                            {
                                cardType: `text`,
                                content: `על מנת להימנע מסינוור, יש להפנות את המבט ימינה, אל עבר שול הכביש והפס הצהוב המסמן את שפת הכביש ולסמן ("להבהב") קלות לנהג המסנוור.`
                            },
                        ],
                    },
                    "תאורה ברכב": {
                        "מערכות תאורה ברכב" : [
                            {
                                cardType: `text`,
                                content: `<b>לרכב שלוש מערכות תאורה עיקריות: </b>
                                <ol>
                                <li><b>אור חניה</b> - כשמו כן הוא - אין לנהוג באורות חניה והם משמשים לאזהרה בשעת חניה בלבד.
                                <span><img class="sml-pic" src="../assets/images/pics/light1.png"/></span>
                                </li>
                                <li>. <b>אור נמוך</b> - אלו הם האורות "שיש להפעיל <b>בנסיעה בדרך עירונית</b> ובכל פעם שקיים חשש כי שימוש באורות הגבוהים ביותר, יסנוור נוהג אחר. והיא מאירה למרחק של כ- <b>30 מטר</b>. 
                                <span><img/ class="sml-pic" src="../assets/images/pics/light2.png"></span>
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol start="3">
                                <li>
                                <b>אור גבוה</b> - האורות "הגבוהים"- טווח האורות הוא כ- <b>100 מטר</b> והם עלולים לסנוור את הנהג המגיע ממול וכן את הנהג הנמצא לפנים (בעת שאלומת האור משתקפת במראותיו). 
                                מותר לנהוג באור זה <b>בדרך שאינה עירונית</b> (בתנאי שלא נגרם סינוור) וכן <b>בדרך עירונית</b>, בעת שזו אינה מוארת כראוי.
                                <span><img/ class="sml-pic" src="../assets/images/pics/light4.png"></span>
                                </li>
                                </ol>
                                `
                            },
                        ],
                    },
                    "יתר הפנסים ברכב": {
                        "פנסים נוספים" : [
                            {
                                cardType: `text`,
                                content: `
                                <ol>
                                <li><b>פנסים לנהיגה לאחור</b> - אורות המופעלים אוטומטית בעת נסיעה לאחור.
                                <span><img/ class="sml-pic" src="../assets/images/pics/light6.png"></span>
                                </li>
                                <li><b>מחווני כיוון</b>.
                                <span><img/ class="sml-pic" src="../assets/images/pics/light5.png"></span>
                                </li>
                                <li><b>פנסי ערפל</b> (לא בכל רכב)- מותר להפעילם רק בעת ערפל, גשם שוטף או שלג.
                                <span><img/ class="sml-pic" src="../assets/images/pics/light2.png"></span>
                                </li>
                                <li><b>פנסי רוחב,</b> ברכב רחב. 
                                <span><img/ class="sml-pic" src="../assets/images/pics/light7.png"></span>
                                </li>
                                <li><b>זרקור</b> - הקיים בסוגים מסוימים של כלי רכב ואשר מותר להפעילו בעת עצירה בלבד ולהפנותו רק לכיוון צידי הדרך ולא אל עבר התנועה.
                                <span><img/ class="sml-pic" src="../assets/images/pics/light8.png"></span>
                                </li>
                                <li>אורות נוספים כגון אור לוחית הזיהוי, פנסי אזהרה צהובים מהבהבים בסוגי רכב מסויימים ועוד. 
                                </li>
                                </ol>
                                `
                            },
                        ],
                    },
                    "סינוור": {
                        "מניעת סינוור" : [
                            {
                                cardType: `text`,
                                content: `<b>על מנת שלא לסנוור כלי רכב אחרים, חייב הנהג:</b>
                                <ol>
                                <li>לדאוג מראש <b>לכיוון</b> נכון של <b>הפנסים</b> ברכב.
                                </li>
                                <li>בכלי רכב בהם ניתן לכוון את הפנסים מתוך הרכב, או שקיים התקן נח אחר לכיוונם, רצוי לשנות את זווית הפנסים, כל עוד שהרכב עמוס מאחור בנוסעים או במטען.
                                </li>
                                <li><b>לעמעם את אורותיו</b> (כלומר להחליף את אור הגבוה באור נמוך), <b>כל עוד שרכב שמגיע ממול</b>.
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol start="4">
                                <li><b>לעמעם את אורותיו</b> בכל עת שאלומת האור של רכבו מאירה את <b>חלקו האחורי של הרכב שלפניו</b>, על מנת למנוע סינוור הנהג שלפנוי במראות.
                                </li>
                                <li><b>לעמעם את אורותיו</b> כל עוד <b>שהרכב בעצירה</b> בדרך המיועדת לתנועה ובעת חניה בדרך כזו - לכבות את אורות המעבר ולהדליק את פנסי החניה.
                                </li>
                                </ol>`
                            },
                        ],
                    },
                    "כלי רכב מיוחדים ורכבים": {
                        "תאורת רכבים מיוחדים" : [
                            {
                                cardType: `text`,
                                content: `מכונה ניידת או נגררת יוארו באמצעות <b>פנס מהבהב אדום</b>, שיותקן <b>מצידו השמאלי</b> של הרכב ובהיעדרו, יותקנו מחזירי אור במקום זה.<br> 
                                בעת נהיגת רכב שרוחבו 210 ס"מ ומעלה, יופעלו בו גם <b>פנסי הרוחב</b>. בשעת החנייתו של רכב כזה, יש להפעיל בו בנוסף לפנסי הרוחב, גם את הפנס האחורי. 
                                `
                            },
                        ],
                    },
                }
            },
            //מצגת 14
            "עצירה וחנייה": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `text`,
                                content: `בפרק זה נחזור על ההבדל שבין <b>עצירה, חניה והעמדת הרכב</b>. <br>
                                כמו כן נבדוק מתי מותר להעמיד רכב וכיצד יש לעשות זאת נכון. <br>
                                בנוסף, נסקור את המקרים בהם אסורה חנית רכב ואפילו עצירתו. 
                                `
                            },
                        ],
                    },
                    "הגדרת חניה ועצירה": {
                        "חניה" : [
                            {
                                cardType: `text`,
                                content: `<b>חניה</b>- העמדת רכב לזמן כל שהוא, <u>שלא לשם העלאת אנשים או הורדתם, טעינת מטען או פריקתו</u> מיד, בלי הפסקות, בין שיש ברכב נהג או אנשים או מטען ובין שאין. 
                                `
                            },
                        ],
                        "עצירה" : [
                            {
                                cardType: `twoPicsAndText`,
                                pic1: `../assets/images/pics/car17.png`,
                                pic2: `../assets/images/pics/car18.png`,
                                content: `<b>עצירה</b> – העמדת רכב <u>לצורך פריקה וטעינה של מטען ברציפות, ללא הפסקות וכן העלאת נוסעים והורדתם</u>, גם כן ברציפות וללא הפסקות. <br>
                                כך למשל <b>לא</b> תוגדר עצירה קצרה כ"חניה" לצורך העלאת נוסע או הורדתו וכן פריקה או טעינה רציפים של מטען מרכב. 
                                `
                            },
                        ],  
                    },
                    "חניה נכונה": {
                        "חניה" : [
                            {
                                cardType: `text`,
                                content: `<b>כיצד לחנות נכון, במקום בו החניה מותרת</b>:
                                עקרונית מותר להחנות רכב רק <b>בדרך עירונית</b> (בתנאי שאין איסור מפורש על כך).<br>
                                לפני חניה, על הנהג לוודא כי במקום בו הוא מתכנן לחנות, אכן מותר לחנות, הוא <b>יבדוק את השטח מסביב לרכב</b>, באמצעות המראות ומבעד לשמשות הרכב, <b>יאותת</b> ורק אז <b>יסטה לכיוון מקום החניה</b>. 
                                הרכב יוחנה במקביל למדרכה, באופן שהמרחק בין גלגליו למדרכה (או לשפץ הכביש) <b>לא</b> יעלה על<b> 40 ס"מ</b> לכל היותר. 
                                `
                            },
                        ],
                        "היכן מותר לחנות" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road23.png`,
                                content: `בכביש חד סטרי, ניתן לחנות משני צידי הכביש, <b>עם כיוון התנועה</b>, אולם מכביש דו סטרי, שהפך לשני כבישים חד סטריים, באמצעות בניית שטח הפרדה, <b>אין לחנות בצד השמאלי</b>, בצמוד לשטח ההפרדה (אלא אם קיים תמרור המורה אחרת). <br>
                                בכביש דו סטרי, שבו יותר מנתיב אחד בכל כיוון נסיעה (ורק בכביש דו סטרי כזה), מותר לחנות <b>רק בצד ימין</b>, <b>במקביל למדרכה</B>, או <b>לאבן השפה</b>. בכביש דו סטרי שבו רק נתיב אחד בכל כיוון נסיעה, <b>אסור לחנות</b>. 
                                `
                            },
                        ],
                        "לשים לב בעת חניה" : [
                            {
                                cardType: `twoPicsAndText`,
                                pic1: `../assets/images/pics/sign5.png`,
                                pic2: `../assets/images/pics/sign6.png`,
                                content: `בעת חניה, יש <b>להבטיח</b> את הרכב מפני הידרדרות ולנקוט בכל האמצעים לשם כך: 
                                <ol>
                                <li>לדומם מנוע ומנגנון הדלקה, להוציא את המפתח ממתג ההצתה, להפעיל בלמי חניה, ככל שהם קיימים ברכב. 
                                </li>
                                <li>לשלב להילוך קדמי-ראשון (במישור, או בעליה), להילוך אחורי במורד, או למצב של חנייה P שמדובר ברכב אוטומט. 
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                pic: `../assets/images/pics/car19.jpg`,
                                content: `
                                <ol start="3">
                                <li><b>להפנות את הגלגלים</b> לכיוון מדרכה או שפת הכביש, בעת חניה במורד או בעליה. <br>
                                <b>החריג לכך</b> - בעת חניה במעלה שיש בו מדרכה, או אבני שפה, יש לסובב את הגלגלים לכיוון מרכז הכביש. הסיבה לכך ברורה- אם ידרדר הרכב, הרי שהוא ייעצר מהר יותר ע"י אבני השפה או מדרכה, בעת שהגלגלים מופנים לעבר מרכז הכביש. 
                                </li>
                                <li>בעת חנית רכב פרטי <b>שהתקלקל</b> בדרך אינה עירונית, <b>יש להציב משולש אזהרה</b>, שיוצב באופן שיראה למרחק <b>100 מטר </b>לפחות לנוהג רכב המגיע מאחור. 
                                </li>
                                </ol>`
                            },
                        ],
                    },
                    "איסור חניה": {
                        'איסור חניה במקומות הנ"ל' : [
                            {
                                cardType: `text`,
                                content: `
                                <ol>
                                <li><b>בדרך שאינה עירונית</b>, פרט לדרך מהירה שבה אסור לעצור בשוליים (למעט מקרים מיוחדים שיוסברו בהמשך), מותר לעצור בשולי הדרך להעלאה או הורדת נוסעים, למעט לשם ביצוע עבודות ציבוריות, שאין דרך אחרת לבצען וכן רכב צה"ל לשם מילוי תפקיד צבאי ולמן עזרה לנהג או רכב (חילוץ נפגעים). 
                                </li>
                                <li>באופן הגורם <b>לעיכוב</b> או <b>הפרעה לתנועה</b>, או באופן הגורם <b>להסתרת תמרור או חלקו</b>. 
                                </li>
                                <li><b>במקביל לכביש אחר</b>. </li>
                                <li><b>על גשר</b>.
                                </li>
                                </ol>`
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol start="5">
                                <li>בכביש דו סטרי, שבו <b>נתיב אחד בלבד</b> בכל כיוון נסיעה.
                                </li>
                                <li>בניצב <b>לשפת הכביש</b>, או בזווית כלשהי ביחס אליה (אלא אם מסומן אחרת).
                                </li>
                                <li><b>לצד מעקה בטיחות</b>.
                                </li>
                                <li><b>על מדרכה</b> (אלא אם מסומן אחרת) ועל <b>שביל המיועד לאופניים</b>. 
                                </li>
                                <li>בכל מקום בו מוצב <b>תמרור האוסר על חניה</b> ועד הצומת הקרוב. 
                                </li>
                                <li><b>בתחנת מונית</b>, למעט להורדת נוסע. 
                                </li>
                                </ol>`
                            },
                        ],
                        "ברז כיבוי" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/beam.jpg`,
                                content: `אסור לחנות ליד ברז כיבוי אש ובטווח של 2 מטר מכל צד שלו. 
                                `
                            },
                        ],
                        "צומת" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road24.png`,
                                content: `בתחום הצומת ובטווח של 12 מטר לפניו ואחריו (אלא אם סומן אחרת).
                                `
                            },
                        ],
                        "מעבר חציה" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road22.jpg`, 
                                content: `על מעבר חציה ובתחום של 12 מטר לפניו.`
                            },
                        ],
                        "קו עצירה" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road22.jpg`, 
                                content: `החל מ 12 מטר לפני קו עצירה.`
                            },
                        ],
                        "תחנת אוטובוס" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/bus.jpg`,
                                content: `בתחנת אוטובוס ובטווח של 20 מטר לפניה ואחריה. אם רוחב הכביש קטן מ 12 מטר, אסור גם לחנות ממול לתחנת אוטובוס, באותם הטווחים.`
                            },
                        ],
                        "מסילת ברזל" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road25.jpg`,
                                content: `על מפגש מסילת ברזל ובטווח של 20 מטר לפני הפס הקרוב ו- 20 מטר אחריו.`
                            },
                        ],
                        "מנהרה" : [
                            {
                                cardType: `picAndText`,
                                pic: `../assets/images/pics/road26.png`, 
                                content: `בתוך מנהרה בטווח של 50 מ' לפניה ואחריה.`
                            },
                        ],
                    },
                    "איסור עצירה וחניה": {
                        "איסור עצירה וחניה" : [
                            {
                                cardType: `threePicsAndText`,
                                pic1: `../assets/images/pics/sign7.png`,
                                pic2: `../assets/images/pics/sign5.png`,
                                pic3: `../assets/images/pics/sign9.png`,
                                content: `
                                <ol>
                                <li>. <b>בדרך מהירה</b> – גם לא לשם העלאת נוסעים או הורדתם. מותר <b>לעצור בדרך כזו רק עקב קילקול או אם סומן אחרת</b>.
                                </li>
                                <li>בכל מקום בו <b>מוצב תמרור</b> האוסר על עצירה ועד לצומת הקרוב.
                                </li>
                                <li>במקום בו מוצב תמרור "<b>מקום חנייה לנכה משתוק רגליים</b>".
                                </li>
                                </ol>`
                            },
                        ],
                    },
                    "יציאה מחניה": {
                        "יציאה מחניה" : [
                            {
                                cardType: `text`,
                                content: `לאחר שחנית, או עצרת בצד הכביש, עליך לחזור אליו ולהמשיך בנסיעתך. תחילה, יש לבדוק אם ניתן להיכנס לכביש ללא גרימת הפרעה או סיכון לתנועה, <b>לאותת</b> ורק אז להשתלב בתנועה הנוסעת.
                                `
                            },
                        ],
                    },
                }
            },
            //מצגת 17
            "הנחיות מיוחדות": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `text`,
                                content: `בפרק זה נסקור בקצרה את ההנחיות המיוחדות לעוברי הדרך הבאים: אופנועים, אופניים, הולכי רגל, רכבי שטח, טרקטורים, טרקטורונים, מכונות ניידות ומוליכי בעלי חיים.
                                `
                            },
                        ],
                    },
                    "אופנוע": {
                        /* cardType: `picAndText`,
                          pic: `../assets/images/pics/x.png`, **/
                        "דגשים לרוכב האופנוע" : [
                            {
                                cardType: `text`,
                                content: `על רוכב אופנוע חלים כל כללי הנהיגה החלים על כלי הרכב בעלי ארבעה גלגלים, אך על הרוכב לזכור היטב: 
                                <ol>
                                <li>צלליתו הקטנה של האופנוע גורמת לעתים לכך שהוא <b>אינו נראה</b> כלל לעיני נהגי המכוניות. 
                                </li>
                                <li><b>האצות, בלימות ושינויי כיון מהירים</b>, עלולים להיות <b>מסוכנים</b> בהרבה באופנועים ולכן יש לנהוג כך שכל אלה יעשו באופן הדרגתי ולא בפתאומיות.
                                </li>
                                <li>אופנוע עלול להחליק לא רק בגלל כתמי שמן בכביש. מים שנזלו לכביש אחרי השקיית צמחיה בכיכר, חול, חצץ, כורכר- כל אלה, כשהם מצטרפים להיטה חזקה מידי, בלימה חזקה, או האצה חזקה, עלולים לגרום לרוכב האופנוע לאבד את השליטה על כלי הרכב.
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol start="4">
                                <li>אין להוביל <b>מטען פגום</b> ביכולת השליטה באופנוע.
                                </li>
                                <li><b>אין לנהוג במקביל</b> לרכב אחר, גם לא במקביל לרכב דו גלגלי אחר.
                                </li>
                                <li>לרוכב אופנוע בנפח 12 סמ"ק, שגילו נמוך מ-18 <b>אסור להסיע נוסע נוסף</b>.
                                </li>
                                <li><b>לרוכב חדש</b>, אסור להסיע נוסע נוסף <b>בחודשיים הראשונים</b>.
                                </li>
                                </ol>`
                            },
                        ],
                    },
                    "אופניים": {
                        "דגשים לרוכבי אופניים" : [
                            {
                                cardType: `text`,
                                content: `עקרונית, חלים כללי התנועה גם על רוכבי אופניים. 
                                עליהם <b>לחבוש קסדות בטיחות</b> בעת הרכיבה ולנסוע בחלקו הימני ביותר של הכביש בצמוד לשפת הכביש. <br>
                                מותר להרכיב נוסע נוסף על אופניים,  בתנאי שגילו של הנוהג בהם <b>מעל 14 שנים</b> וגיל הרוכב קטן מ-<b> 8 שנים</b>. 
                                זכור- גם לרוכב אופניים <b>מותר </b>לנסוע בנתיב המיועד לתחבורה ציבורית בלבד.
                                `
                            },
                        ],
                    },
                    "הולכי רגל": {
                        "דגשים להולכי רגל" : [
                            {
                                cardType: `text`,
                                content: `ככלל, רשאים הולכי רגל לנוע <b>במדרכה</b>, או <b>בשביל שהוקצה במיוחד עבורם</b>. 
                                אם אין מדרכה, עליהם ללכת <b>בשול הכביש</b> ואם הם חייבים לנוע בכביש, הרי שעליהם לנוע <b>נגד כיוון התנועה</b>, כלומר צמוד לשפתו השמאלית של הכביש כשפניהם אל מול פני התנועה המתקרבת. 
                                `
                            },
                        ],
                        "חציית מסילת רכבת" : [
                            {
                                cardType: `text`,
                                content: `לפני חציית פסי רכבת, חייב ההולך לוודא <b>שאין רכבת מתקרבת</b> ושניתן לחצות את המסילה <b>בבטחה</b>. <br>
                                אם הוא ממתין, עד שהרכבת תחלוף, עליו לשמור מרחק של 6 מטר לפחות מהפס הקרוב אליו. <br>
                                בשום מקרה אין הולך רגל רשאי לחצות את מפגש מסילת הברזל אם <b>המחסום נמצא בתנועה</b>, בין שהוא עולה ובין שהוא יורד. 
                                `
                            },
                        ],
                    },
                    "רכב שטח": {
                        "רכב שטח" : [
                            {
                                cardType: `text`,
                                content: `רכב שטח, כפי שהוא מוגדר בתקנות <b>אין הכוונה</b> ל"ג'יפים" ורכבי 4X4 למיניהם. ל"לרכב שטח" כזה <b>אסור לנוע בכביש</b>, אלא לשם חצייתו בלבד.<br>
                                מהירותו המירבית המותרת של רכב כזה היא<b> 40 קמ"ש</b> בלבד והוא <b>אינו רשאי להסיע נוסף</b>, אלא על פי היתר מיוחד של רשות הרישוי.<br>
                                הנוהג ברכב שטח והנוסע שעמו (ככל שיש היתר לכך כאמור) חייבים<b> לחגור חגורת בטיחות</b> בעת הנהיגה.
                                `
                            },
                        ],
                    },
                    "טרקטור משא": {
                        "טרקטור משא" : [
                            {
                                cardType: `text`,
                                content: `לטרקטור, כמו לרכב איטי אחר, <b>מותר לנוע בכביש</b>, אם כי לא מומלץ. <br>
                                במידה והוא מעכב את התנועה שמאחוריו, <b>הוא חייב להיימן</b>, לנבוע בשול, אם הוא סלול אספלט, ולאפשר <b>לתנועה שמאחוריו לעקוף אותו</b>. 
                                מהירותו המירבית המותרת של טרקטור תהיהb> 40 קמ"ש</b> והוא<b> אינו רשאי להסיע נוסע נוסף</b>, אלא על פי היתר מיוחד מרשות הרישוי.<br> 
                                נהג טרקטור והנוסע (ככל שיש היתר לגביו) חייב <b>לחגור חגורת בטיחות</b> בשעת הנסיעה בטרקטור. 
                                `
                            },
                        ],
                    },
                    "טרקטורון": {
                        "טרקטורון" : [
                            {
                                cardType: `text`,
                                content: `טרקטורן <b>אינו רשאי לנוע בכביש הציבורי</b>, אלא רק בכבישים פנימיים של מושבים וקיבוצים בלבד. <br>
                                מהירותו המירבית המותרת היא<b> 40 קמ"ש ואין להסיע בו נוסע נוסף</b>, אלא על פי היתר מיוחד של רשות הרישוי. בדומה לאופנוע, חלה <b>חובה לחבוש קסדה </b>בעת נהיגה בטרקטורון. 
                                `
                            },
                        ],
                    },
                    "מכונה ניידת" : {
                        "מכונה ניידת" : [
                            {
                                cardType: `text`,
                                content: `מכונה ניידת נועדה <b>לביצוע עבודות</b>. מכאן <b>שאין</b> לגרור עימה כל גרר שהוא, אלא רק גרור המיועד לביצוע אותה עבודה, שלשמה קיימת המכונה הניידת עצמה.<br> 
                                מהירות המירבית המותרת לא תעלה על<b> 40 קמ"ש</b>.<br> 
                                אם<b> עלה רוחבה על 255 ס"מ</b>, היא תסומן באמצעות שלטים בכיתוב: "זהירות רכב רחב" בחזית המכונה ובאחוריה.<br> 
                                אם עלה רוחבה של מכונה חקלאית על<b> 340 ס"מ</b>, יש להתקין בה מלפנים ומאחור שלט "זהירת- מטען רחב" וכן יותקנו בה <b>פנסי רוחב ותאורה היקפית</b>. 
                                `
                            },
                        ],
                    },
                    "הולכת בעלי חיים": {
                        "הולכת בעלי חיים" : [
                            {
                                cardType: `text`,
                                content: `<b>הולכת בעלי חיים בזמן תאורה:</b>
                                <ul>
                                <li>אם מדובר בבעל חיים <b>יחיד</b> - ישא עימו המוליך פנס או צהוב מצד שמאל.
                                </li>
                                <li>אם מדובר<b> בעדר </b>- יצטרף מלווה נוסף מאחורי העדר וישא גם הוא פנס כזה מאחור ומשמאל.
                                </li>
                                </ul>
                                `
                            },
                        ],
                    }
                }
            },
            //מצגת 19
            "תיבת הילוכים אוטומטית":{
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `text`,
                                content: `בארץ מצוידים כלי רכב מודרנים.
                                רובם בתיבת הילוכים אוטומטית  (חלקן תיבות רובוטיות, חלקן אוטומטיות רגילות). <br>
                                מאפיין תיבות אלה, הוא בעיקר חוסר הצורך לבחור בהילוך המתאים (למרות שבכלי רכב אוטומטים מסויימים, קיימת אפשרות כזו) וחוסר הצורך במצמד המופעל רגלית ע"י הנהג, כלומר במצב נהיגה רגיל, לא יעשה הנהג בשימוש ברגלו השמאלית.<br> 
                                בפרק זה נעמוד במספר <b>מאפיינים של רכב כזה</b> והשפעתם על הנהיגה.
                                `
                            },
                        ],
                    },
                    "הרכב האוטומטי": {
                        "הכרת הרכב האוטומטי" : [
                            {
                                cardType: `text`,
                                content: `בתיבה האוטומטית הנפוצה, נמצאת ידית, <b>המאפשרת בחירה בין כמה מצבים: </b>
                                <ol> 
                                <li>מצב חנייה המסומן באות P</li>
                                <li>מצב ניגה לאחור המסומן באותR </li>
                                <li>מצב סרק המסומן באותN 
                                </li>
                                <li>מצב נהיגה רגיל, המסומן באות D, או באמצעות מספר כלשהו (לרוב 1-4) 
                                </li>
                                <li>במצבים נוספים שילוב לאחד ההילוכים הנמוכים יותר והם המסומנים באמצעות האות L, או באמצעות מספרים, המסמלים הילוכים נמוכים מההילוך הגבוה ביותר. 
                                </li>
                                </ol>
                                `
                            },
                        ],
                        "מאפיינים" : [
                            {
                                cardType: `twoPicsAndText`,
                                pic1: `../assets/images/pics/car22.png`,
                                pic2: `../assets/images/pics/car23.png`,
                                content: `רכב אוטומטי, <b>קובע בעצמו</b> את ההילוך המתאים ביותר, תוך שהתיבה האוטומטית <b>משקללת את כל הרכיבים</b> ובין היתר: מהירות הרכב, מידת ההאצה, ההתנגדות (הנובעת משיפוע הדרך) וכו. 
                                `
                            },
                        ],
                        "חניה והתנעה" : [
                            {
                                cardType: `text`,
                                content: `בשעת חניה, יש לשלב רכב אוטומטי <b>להילוך חנייה P </b>, בעוד שברכב בעל תיבת הילוכים ידנית, יש כזכור צורך לשלב <b>להילוך ראשון</b>, כשמדובר על חניה במעלה <b>ושילוב להילוך אחורי</b>, כשמדובר בחניה במורד. 
                                רכב אוטומטי, יותנע, כשידית ההילוכים משולבת במצב חנייה P או לעיתים במצב סרק N.<br> 
                                על מנת להוציא את הרכב ממצב חנייה על הנהג <b>ללחוץ על דוושת הבלם</b>, כדי להבטיח את הרכב מפני דרדור. יש להמשיך וללחוץ על דוושת הבלם,<b> גם בעת שיחרור בלם היד</b>.
                                יידרש הנהג בחלק מכלי הרכב, ללחוץ על מתג שחרור בידית הילוכים <b>שיאפשר שילוב להילוך נסיעה </b>כלשהו.  
                                `
                            },
                        ],
                        "נסיעה" : [
                            {
                                cardType: `text`,
                                content: `בעת נסיעה ייתכן והנהג ירצה ביוזמתו לשלב להילוך נמוך יותר מזה שהמערכת האוטומטית שילבה.<br> 
                                כך למשל לפני עקיפה, בעת שהמערכת אינה "יודעת" שבכוונת הנהג להאיץ בעוד מספר שניות. שילוב כזה יכול שייעשה באמצעות <b>ידית ההילוכים</b>, או ע"י <b>לחיצה קצרה וחזקה</b> על <b>דוושת התאוצה</b>, שתגרום גם היא להורדה "מאולצת" של ההילוך.
                                `
                            },
                            {
                                cardType: `text`,
                                content: `כך גם בעת נהיגה במורד תלול- המערכת האוטומטית אינה מזהה את שיפוע הדרך, אלא רק את העובדה שאין התנגדות והמנוע אינו מתאמץ ומשום כך היא <b>משלבת להילוך גבוה</b>. <br>
                                על הנהג<b> להתערב ידנית </b>ולשלב להילוך נמוך יותר, על פי מידת שיפוע הדרך, <b>כדי לשמור על מהירות נמוכה</b>, להיעזר מעט בכח המנוע להאטת הרכב ולסייע בשמירה מפני הדברת מהירות לא רצויה.
                                `
                            },
                        ],
                    },
                }
            },
            //מצגת 20
            "סמים ונהיגה": {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `text`,
                                content: `נהיגה בצירוף אלכוהול מסוכנת ביותר ולכן <b>אסורה</b>, בכל כמות שהיא. <br>
                                לעיתים, די בתרופה חזקה, על מנת להשפיע על כושר הנהיגה.<br> 
                                אסור בתכלית האיסור לנהוג תחת השפעת סמים משכרים, בין סמים הקרויים "קלים" ובין אחרים.<br> 
                                בנוסף נציג גם את השפעת האלכוהול על כישורי הנהיגה.
                                `
                            },
                        ],
                    },
                    "אלכוהול כהשפעה על נהיגה": {
                        "אלכוהול כהשפעה על נהיגה" : [
                            {
                                cardType: `text`,
                                content: `<b>לאלכוהול השפעה הרסנית על כישורי הנהיגה של כל אדם: </b>
                                <ol>
                                <li>אלכוהול פועל בדרך דומה לסם מדכא והוא <b>מדכא את יכולת התגובה של הנהג</b>.
                                </li>
                                <li>אלכוהול משפיע על <b>כושר השיפוט</b> ומידת <b>לקיחת הסיכון</b> אצל הנהג, באופן שהוא עלול לגרום לנטילת סיכונים שהנהג לא היה נוטל אותם, לו היה פיכח. 
                                </li>
                                <li>אלכוהול משבש את <b>כישוריו הקואורדינטיביים</b> של הנהג. 
                                </li>
                                </ol>
                                `
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol start="4">
                                <li>אלכוהול משבש את <b>כושר הראיה ההיקפית</b> של הנהג.
                                </li>
                                <li>אלכוהול משבש במידה רבה את <b>כושרה של העין להתאושש</b> במהירות <b>מסינוור</b>.
                                </li>
                                <li>אלכוהול גורם זמנית לפגימה <b>בחדות הראיה</b> של הנהג. 
                                </li>
                                <li>אלכוהול גורם להפרעות קשות בכושר <b>אומדן מרחק ומהירות</b>. 
                                </li>
                                <li>אלכוהול גורם <b>לתחושת נימנום ורצון לישון</b>.
                                </li>
                                </ol>
                                ויודגש – גם<b> מלווה</b> של נהג חדש, אסור לשתות ואסור לו להיות תחת השפעת אלכוהול! `
                            },
                        ],
                    },
                    "אלכוהול": {
                        "אלכוהול" : [
                            {
                                cardType: `text`,
                                content: `
                                <ol>
                                <li>גם בירה היא <b>משקה אלכוהולי</b>.
                                </li>
                                <li>אין הבדל מהותי בין כוס בירה, לבין כוס ויסקי- שכרות נגמרת כתוצאה מכמות אלכוהול הנספגת בדם. כוסית ויסקי, עלולה להכיל כמות אלכוהול <b>זהה</b> לזו שבכוס בירה. 
                                </li>
                                <li>אין יסוד לאגדה ש"רק עירבוב של משקאות אחדים גורם לשכרות ואילו משקה אחד אינו מעורבב, מבטיח מפני שכרות"- אלו הן אגדות מופרכות. 
                                </li>
                                </ol>`
                            },
                        ],
                        "אכיפת שתיית האלכוהול" : [
                            {
                                cardType: `text`,
                                content: `שוטר רשאי <b>לעצור</b> נהג על מנת לבדוק את כמות האלכוהול בגופו, בכל עת, שיש לו חשד סביר להניח, כי הנהג שיכור. <br>
                                הנהג <b>חייב</b> לציית לדרישה זו, ובמידה והוא לא מציית הוא צפוי <b>לעונש</b> של מאסר שנה אחת, או קנס של- 10,000 ₪, ולפסילת רישיון הנהיגה למשך שנתיים. 
                                `
                            },
                        ],
                        "בדיקת האלכוהול" : [
                            {
                                cardType: `text`,
                                content: `בבדיקת הנשיפה, אותה מבצע השוטר, נושף הנהג הנבדק אוויר לתוך מכשיר מדידה, המציין את כמות האלכוהול בדמו של הנבדק.<br>
                                בדיקה כזו קבילה<b> בבית משפט</b> ועלולה לשמש<b> ראיה</b> כנגד הנהג
                                על מנת שניתן יהיה להרשיע נהג בגין נהיגה בשכרות. 
                                `
                            },
                        ],
                    },
                    "תרופות ונהיגה": {
                        "תרופות ונהיגה" : [
                            {
                                cardType: `text`,
                                content: `אין כלל גורף הקובע כי אסור לנהוג לאחר לקיחת כל תרופה. יחד עם זאת ישנן תרופות, כגון תרופות <b>הרגעה</b> למיניהן, שהשפעתן עלולה לגרום לנימנום, לעייפות, לחוסר ריכוז ולהשפעות שליליות אחרות, הקשורות <b>ביכולת התגובה ובעירנות הנהג</b>. <br>
                                היוועץ עם הרופא שלך ועיין בעלון המצורף לתרופה, על מנת שתהיה בטוח, כי הינך יכול לנהוג בבטחה לאחר נטילתה. 
                                `
                            },
                        ],
                    },
                }
            },
            //מצגת 21
            "דרכים הרריות" : {
                learningContent: {
                    "הקדמה": {
                        "הקדמה" : [
                            {
                                cardType: `text`,
                                content: `בעת נסיעה בדרכים הרריות, נדרש הרכב למאמצים מיוחדים והוא נתון להשפעתם של כוחות פיסיקאליים גדולים יותר מאשר במישור.<br> 
                                השליטה ברכב, חשובה ביותר בעת נהיגה בדרכים כאלה. <br>
                                בפרק זה נסקור את <b>הסכנות שבדרך</b> ואת <b>אופן הנהיגה הנכון</b> מסוג זה של דרכים. 
                                `
                            },
                        ],
                    },
                    "הדרך ההררית": {
                        "מאפיינים" : [
                            {
                                cardType: `text`,
                                content: `
                                <ol>
                                <li>שיפוע העלול להיות <b>תלול</b> (מעלה תלול, או לחילופין מורד תלול).
                                </li>
                                <li>במקרים רבים מדובר <b>בדרך צרה</b>.
                                </li>
                                <li>במקרים רבים <b>העקומות</b> בהן<b> חדות</b>.
                                </li>
                                <li> <b>שדה הראיה מוגבל</b>.
                                </li>
                                <li><b>לא תמיד קיימים שוליים רחבים מספיק </b>(או שהם כמעט ולא קיימים כלל).
                                </li>
                                </ol>`
                            },
                        ],
                        "הסכנות" : [
                            {
                                cardType: `text`,
                                content: `
                                <ol>
                                <li>שדה הראיה המוגבל עלול לגרום <b>להפתעות</b> באזור המתגלה לנהג מבלי שניתן לו זמן מספיק להתכונן לכך. 
                                </li>
                                <li><b>חימום יתר של הבלמים</b>, העלול לגורם לאובדן בלמים, עקב שימוש לא נכון בהם בעת נהיגה במורד. 
                                </li>
                                <li><b>סינוור</b> בגלל הזווית בהן נתונים כלי הרכב.
                                </li>
                                <li><b>קשיים למנוע של הרכב</b> אם הרכב עמוס מאד והמעלה התלול. 
                                </li>
                                <li>במקרים רבים מדובר בדרכים שאינן עירוניות ולכן <b>חסרה בהן תאורה</b>.
                                </li>
                                </ol>`
                            },
                        ],
                        "הדרך הנכונה לנהוג בדרכים אלו" : [
                            {
                                cardType: `text`,
                                content: `
                                <ol>
                                <li>. יש לשמור על <b>הימין </b>, בעיקר בעת נהיגה בעיקולים. 
                                </li>
                                <li>יש לשמור על <b> מהירות </b> כזו שלא תאלץ את הנהג להיגרר לתוך הנתיב הנגדי, בעת הופעת עיקול פתאומי בכביש. 
                                </li>
                                <li>יש לשים לב <b> לתמרורי האזהרה </b>, המאפשרים לנהג להתכונן מראש לעיקולים, צמתים או סכנות, אליהם הוא מתקרב. 
                                </li>
                                <li>בעת נהיגה <b> במורד </b> יש לנהוג <b> בהילוך נמוך </b>, בהתאם לשיפוע הדרך ולהיעזר בכח המנוע להאטת הרכב. 
                                </li>
                                </ol>`
                            },
                            {
                                cardType: `text`,
                                content: `
                                <ol>
                                <li>יש להשתמש באמצעי <b>האטה</b> ייעודיים, ככל שהם קיימים ברכב. 
                                </li>
                                <li><b>אין לנהוג בהילוך סרק</b>.
                                </li>
                                <li>יש להשתדל <b>שלא</b> להפעיל את בלמי השירות באופן רצוף לפרקי זמן ארוכים על מנת למנוע חימום יתר ואובדן בלמים. 
                                </li>
                                </ol>`
                            },
                        ],
                    },
                }
            },

            "": {
                /* cardType: `picAndText`,
                  pic: `../assets/images/pics/x.png`, **/
                "" : [
                    {
                        cardType: `text`,
                        content: ``
                    },
                ],
            },
        
        }
    },
    // "הכרת הרכב": {
    //     "icon": "",
    //     "questions": [],
    //     lessons: {}
    // },
    // "רכב משא": {
    //     "icon": "",
    //     "questions": [],
    //     lessons: {}
    // },
}




/********************************************************************************************************/
/********************************************************************************************************/
/********************************************************************************************************/
/*****  אובייקטים לפי סוג הכרטיסייה המכניסים את התוכן של כל כרטיסייה אל תוך הכרטיסייה  ********/

/**
 * @type {{[index: string]: {init: (card: HTMLElement, json: any) => void}}}
 */
let CARD_TYPES = {};

CARD_TYPES.text = {
    init(card, json) {
        card.querySelector(".content").innerHTML = json.content;
    }
}

CARD_TYPES.textTwoParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
    }
}

CARD_TYPES.textThreeParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
        card.querySelector(".text3").innerHTML = json.text3;
    }
}

CARD_TYPES.picAndText = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.twoPics = {
    init(card, json) {
        card.querySelector(".pic1").src = json.pic1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".pic2").src = json.pic2;
        card.querySelector(".content2").innerHTML = json.content2;
    }
}
CARD_TYPES.video = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
    }
}
CARD_TYPES.videoAndText = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.pic_4titles_4text = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
        card.querySelector(".sub-title4").innerHTML = json.subTitle4;
        card.querySelector(".content4").innerHTML = json.content4;
    }
}
CARD_TYPES._3titles_3text = {
    init(card, json) {
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
    }
}

CARD_TYPES.list3 = {
    init(card, json) {
        card.querySelector(".sub-title").innerHTML = json.subTitle;
        card.querySelector(".li1").innerHTML = json.li1;
        card.querySelector(".li2").innerHTML = json.li2;
        card.querySelector(".li3").innerHTML = json.li3;
    }
}
CARD_TYPES.youtube = {
    init(card, json) {
        card.querySelector(".youtube").src = json.youtube;
  
    }
}
CARD_TYPES.pics = {
    init(card, json) {
        card.querySelector(".pic1").src = json.pic1;
        card.querySelector(".pic2").src = json.pic2;
        card.querySelector(".pic3").src = json.pic3;
    }
}
CARD_TYPES.twoPicsAndText = {
    init(card, json) {
        card.querySelector(".content").innerHTML = json.content;
        card.querySelector(".pic1").src = json.pic1;
        card.querySelector(".pic2").src = json.pic2;
    }
}
CARD_TYPES.threePicsAndText = {
    init(card, json) {
        card.querySelector(".content").innerHTML = json.content;
        card.querySelector(".pic1").src = json.pic1;
        card.querySelector(".pic2").src = json.pic2;
        card.querySelector(".pic3").src = json.pic3;
    }
}
